{
  "pdfs": {
    "2. Course Pledge - App Brewery 100 Days of Python.pdf": "THE APP BREWERY\n100 Days of Python Pledge\nI _____________________________ am committed to completing the 100 days of Python challenge.\nI hereby pledge to work for at least an hour on Python programming for 100 days.\nI will keep myself on track, even though some days I might feel tired or frustrated.\nI will keep myself accountable, even though I have lots of things to do, I will make this a priority in my\nlife.\nI will overcome difficulties and achieve my goal.\nI will become a Python developer.\nI believe in myself.\nSignature: _______________________________\nDate Signed: ______________________________\nThe App Brewery, London, UK\nwww.100daysofpython.dev",
    "3. 100 Days of Python Check Off Posters.pdf": "100 Days of Python\n1 1 6 3 1 4 6 6 1 7 6 9 1\n2 1 7 3 2 4 7 6 2 7 7 9 2\n3 1 8 3 3 4 8 6 3 7 8 9 3\n4 1 9 3 4 4 9 6 4 7 9 9 4\n5 2 0 3 5 5 0 6 5 8 0 9 5\n6 2 1 3 6 5 1 6 6 8 1 9 6\n7 2 2 3 7 5 2 6 7 8 2 9 7\n8 2 3 3 8 5 3 6 8 8 3 9 8\n9 2 4 3 9 5 4 6 9 8 4 9 9\n1 0 2 5 4 0 5 5 7 0 8 5 1 0 0\n1 1 2 6 4 1 5 6 7 1 8 6\n1 2 2 7 4 2 5 7 7 2 8 7\n1 3 2 8 4 3 5 8 7 3 8 8\n1 4 2 9 4 4 5 9 7 4 8 9\n1 5 3 0 4 5 6 0 7 5 9 0\n\n100 Days of Python\n1 1 6 3 1 4 6 6 1 7 6 9 1\n2 1 7 3 2 4 7 6 2 7 7 9 2\n3 1 8 3 3 4 8 6 3 7 8 9 3\n4 1 9 3 4 4 9 6 4 7 9 9 4\n5 2 0 3 5 5 0 6 5 8 0 9 5\n6 2 1 3 6 5 1 6 6 8 1 9 6\n7 2 2 3 7 5 2 6 7 8 2 9 7\n8 2 3 3 8 5 3 6 8 8 3 9 8\n9 2 4 3 9 5 4 6 9 8 4 9 9\n1 0 2 5 4 0 5 5 7 0 8 5 1 0 0\n1 1 2 6 4 1 5 6 7 1 8 6\n1 2 2 7 4 2 5 7 7 2 8 7\n1 3 2 8 4 3 5 8 7 3 8 8\n1 4 2 9 4 4 5 9 7 4 8 9\n1 5 3 0 4 5 6 0 7 5 9 0\n\n100 Days of Python\n1 1 6 3 1 4 6 6 1 7 6 9 1\n2 1 7 3 2 4 7 6 2 7 7 9 2\n3 1 8 3 3 4 8 6 3 7 8 9 3\n4 1 9 3 4 4 9 6 4 7 9 9 4\n5 2 0 3 5 5 0 6 5 8 0 9 5\n6 2 1 3 6 5 1 6 6 8 1 9 6\n7 2 2 3 7 5 2 6 7 8 2 9 7\n8 2 3 3 8 5 3 6 8 8 3 9 8\n9 2 4 3 9 5 4 6 9 8 4 9 9\n1 0 2 5 4 0 5 5 7 0 8 5 1 0 0\n1 1 2 6 4 1 5 6 7 1 8 6\n1 2 2 7 4 2 5 7 7 2 8 7\n1 3 2 8 4 3 5 8 7 3 8 8\n1 4 2 9 4 4 5 9 7 4 8 9\n1 5 3 0 4 5 6 0 7 5 9 0",
    "3. 12+Rules+to+Learn+to+Code+eBook-Copyright App Brewery.pdf": "LEARN TO\nCODE\n\n(cid:504)(cid:505) Rules to\nLearn to Code\nDr. Angela Yu\niOS, WatchOS and Web Developer\nLead Instructor at The App Brewery\nwww.appbrewery.co\n\nContents\n1.Trick Your Brain with the 20min Rule\n2. Code for a Purpose. Have a project\n3. There is no “perfect language to learn”\n4. Understand what you’re writing\n5. It’s Ok to Not Know\n6. Be a Copycat\n7. Be accountable to someone. Show your work\n8. Keep Learning\n9. Play Foosball\n10. Get a mentor - Try Pair Programming\n11. Get into the Habit of Chunking\n12. Break someone else's code\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n1\n\n(cid:504)\nTrick Your Brain with\nthe (cid:505)(cid:503)min Rule\nLearning to code is a bit like going to the gym. Even if you max out and\nspent a whole weekend at the gym, you will not see a visible difference in\nyour body. The more regularly you learn to code, the more likely it is that\nyou’ll start seeing your ripped coding muscles. (The irony is not lost on\nme).\nBut the problem is where do you find the time? Between working your\nfull-time job, spending time with your family and life admin, when are you\nsupposed to sit down and practice this “daily coding”?\nWhile I was working as a doctor, I spent about 12 hours at the hospital,\n1-hour commuting and approximately 2 hours on general life-sustaining\nstuff, such as eating. So that left me with only 9 hours remaining in my day.\nTheoretically, 2 hours could be allocated to coding practice and 7 hours on\nsleep. But there is nothing more difficult than trying to convince your\nwork-saturated brain to sit down and learn when you could be watching\nGame of Thrones with a tub of ice-cream.\nBut then I found a trick.\nAs humans, we have a lot of inertia. This can be bad for us - I’m looking at\nyou, “24” box set. However, we can also turn it to our advantage. I found\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n2\n\nthat once I got started coding and making things, I got so absorbed into the\nproject, that I no longer cared about TV, food or sleep. There were quite a\nfew weekends when I coded until sunrise.\nSo how do we take advantage of this inertia? First, you must understand\nthat task-switching is very difficult. It requires a lot of motivation. If as soon\nas you get home, you slump on the sofa and switch on the TV, you’ve\nalready lost that evening. This is because the amount of motivation required\nto task-switch and do something not driven by evolution like eating or\nsleeping is a Herculean task.\nThis is why the moment you enter the door and change to a new\nenvironment is the most crucial moment. If at this moment, you tell yourself\nthat you are just going to do 20 minutes of coding practice, you will most\nlikely succeed and use your own inertia to end up learning for an hour or\nmore. No brain will perceive a 20-minute task as a lot of effort and you end\nup tricking your brain to take advantage of your evening.\nThe next step is to develop a habit. Research suggests that in order to\ndevelop a new habit, you have to carry out the task daily for a month. I’ve\nused this next trick for loads of different things, from exercising to coding, it\ninvariably works like a charm. To preface this trick, I want you to imagine a\nwall with five paintings hanging on it, four of which are perfectly aligned,\nperfectly horizontal, but one is crooked. Now really imagine it, is there a part\nof you that wants to fix it?\nNow let’s imagine a monthly calendar with boxes representing individual\ndays. If you nurtured that new habit on a particular day, then you make a\nline through that day. If you continued your streak the next day then you\nextend that line and so on and so forth. There is something about not\nbreaking a continuous line that motivates most people to continue to\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n3\n\ndevelop a habit. As strange as it sounds, there are many times when I would\nhave given up, but compelled to continue because of a long, continuous line.\nTry it out with a printable calendar over here.\n​ ​\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n4\n\n(cid:505)\nCode for a Purpose\nWhen I first started learning how to code, there were countless times when I\npicked it up then gave up, again and again. This is a common story amongst\nself-taught coders. Looking back, after teaching so many students, I finally\nrealise what’s going on. A lot of beginners start learning to code by picking\nan arbitrary language and follow along with a bunch of tutorials. Copying\ncode, line by line, sometimes writing code to work out prime numbers, other\ntimes to find all the even numbers. But you know what? I can find prime\nnumbers a lot faster by Googling for it and picking out even numbers is\nreally not all that interesting.\nHere’s the truth. If you are learning to code for the sake of learning to code,\nit’ll be pretty difficult for you to get good at it. Skills that require a lot of\ntime to hone, like programming, will eat into your pool of internal\nmotivation. Something from within that makes you forget to eat and sleep. I\ncan honestly say that coding on my own projects is one of the most\nenjoyable things I do. It combines logical thinking with creativity, and at the\nend, you will have made something. In most cases, something that the\nworld has never seen. Something that could make your life easier or more\nenjoyable. Something that could make loads of people's lives easier and\nmore enjoyable. It’s like making a crazy-beautiful custom motorbike in your\ngarage, without needing the garage or spending a cent on the components.\nThis is what motivates most people. The creating part. The making part. So I\nurge you to start learning to code by following a tutorial that makes\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n5\n\nsomething, anything. Of course, it’s unlikely that at the beginning you’ll be\nable to code up Clash of Clans or League of Legends. But you’ll be able to\nmake something interesting. It could be a dice game or a flash-card app. But\nas long at the end of the tutorial, you’ll have made something you can use\nand play with, then you’ll be far more motivated to code to the end.\nDuring all our courses, we always tell our students to think up of a simple\napp that they want to make. Something that uses the skills that they’ve\nlearnt during the course but will also stretch them a little because they have\nto find out how to include some new functionality.\nWe had a student who went on to make an app that wakes them up a\nminute earlier every day to ease the transition to an earlier waking time.\nThere’s a student who made a custom slideshow app as a mother’s day\npresent. Someone else made an app that is a timer for making perfect\nsteaks based on its weight and thickness.\nThere are no limits on your imagination. It will be difficult when you start\nworking on your own app because there are no step-by-step instructions,\nbut it will also bring about the biggest improvement in your coding ability.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n6\n\n(cid:506)\nThere is No “Perfect\nLanguage to Learn”\nWhenever I do large talks, there will always be one person who asks me\n“which programming language should I start learning first”? There is this\ncommon perception that somewhere out there lies a perfect language for\nbeginner programmers. Some argue it’s Python, some say it’s Swift.\nBut I say they’re all wrong.\nA programming language is simply a tool. It is no different from any other\ntool in your hardware box. If you want to hammer a nail, you should be\nusing a hammer. If you want to fix your water pipes, you’ll probably need a\nspanner. Yes, it’s possible to hammer in a nail using the side of the spanner\nand the same programming language can be used to solve different types of\nproblems. The carpenter will tell you that his favourite tool is a hammer and\nthe plumber will say it’s the spanner, but it still doesn’t make it the “best\ntool to fix things”.\nA web developer will tell you that JavaScript is the best language to learn for\na beginner. A statistician will advise you that you’ll be best served with the R\nprogramming language. But at the end of the day, all that matters is what\nyou are trying to do with your tool. If you want to make iOS apps, then learn\nSwift. If you want to make websites, you’ll need JavaScript. But the good\nnews is the core programming concepts: loops, conditionals, functions, etc.\nthey’re all the same. The difference is mostly syntactical. In English, we\nhave werewolves, in German they have Werwölfe. It’s still the same\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n7\n\nshirt-ripping mammal that comes out during a full moon, it’s just spelt\ndifferently.\nPrinting to the console in Swift:\nprint(“Hello Werewolves”)\nPrinting to the console in Java:\nprintln(“Hello Werwölfe”)\nSo, decide on the task that you are trying to accomplish, then pick the best\ntool for that task.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n8\n\n(cid:507)\nUnderstand What You’re\nWriting\nI have an issue with the way that most programming tutorials are written.\nThere are far too many tutorials where you see the “this is how you draw an\nowl” phenomenon.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n9\n\nIt’s almost as if the programmer had good intentions and started off by\nshowing you how to do everything, step-by-step. But then, at some point,\nhe realises that he has embarked on a Sisyphean task and gives up. I’ve\nseen tutorials where the author starts off with an excruciating level of detail\nthen mid-way reverts to “now you simply set up a cloud database”. Bearing\nin mind that this is a tutorial aimed at beginners!\nThis leads to a number of problems. The most common problem is a student\nwho just copies the code in the tutorial and has no clue what any of it does.\nWhy did he add that extra line after parsing the JSON? Why is he making\nthis dictionary differently from the last one?\nIt’s very easy to get knees deep in one of these types of tutorials because it\npromises to teach you how to build “Flappy Bird” or “Candy Crush”. But\ntwo-thirds of the way in, none of the things you’re typing makes sense and\nyou start seeing red all over the screen. Bugs. Loads of them. Why? No idea.\nNothing runs. The last 3 hours were spent copying code and you learnt\nnothing other than maybe that coding sucks.\nDon’t get into this trap. If you see a tutorial that has jumps from beginner to\nadvanced after line 3 or uses the word “simply” too liberally or doesn’t\nexplain any of their code, then stop. Leave that tutorial.\nThere’s plenty of fish in the sea.\nOther times, the author does try to explain what they’re doing. But you still\ndon’t understand a thing that they’re saying, then you’re in an advanced\ntutorial that won’t improve your programming. It can be tempting to build\ngrand things, especially when the blog is promising that anyone can make it.\nBut if you can’t work out what’s going on, you’re be better served by\nbuilding a better foundation.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n10\n\nThe key to learning to code is all about ramping. You want to be stretched\nover and over again and for knowledge to be built on previous knowledge. If\nthat ramp is too steep, you’ll get lost. If that ramp is too shallow, you’ll get\nbored. The right gradient is different for everyone. That’s why we encourage\nstudents to use the speed change functionality liberally on our tutorials. This\nway, you can listen at double speed if you’re comfortable with the concepts\nand slow down to half speed if it’s something unfamiliar and you need time\nto understand and absorb.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n11\n\n(cid:508)\nIt’s Ok to Not Know\nSoftware engineers are purportedly the profession that has the largest\npopulation of Imposter Syndrome sufferers. Imposter Syndrome is a\npsychological phenomenon where people feel like frauds and massively\nunderestimate their own skills and abilities.\nProgrammers tend to be self-critical and constantly feel that everyone else is\nbetter at programming than they. If you’ve ever felt this way, you’re not\nalone, as studies show that a massive 70 percent of people have imposter\n​ ​\nsyndrome.\n​\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n12\n\nI recently saw a post on the Q&A site Quora where somebody asked: “Would\n​\nI get fired at Google (or another big tech firm if I got caught using\nStackOverflow as a reference?”\nHe got a bunch of really great answers from engineers working at Google,\nAmazon and other major tech companies. Anybody who has worked as a\nsoftware engineer will tell you that not looking at references is far more\n​ ​\nfrowned upon. In fact, I challenge you to find a single Google programmer\nwho has not used Stack Overflow. (If you’re not familiar, StackOverflow is a\ncollaborative Q&A site for programmers).\nA lot of new programmers are afraid that by checking references and asking\npeople for help they will out themselves as a fraud who doesn’t know to\nprogramme. Nobody can hold all the relevant information in their head. For\nexample, this is the name of an iOS method:\n- (id)initWithBitmapDataPlanes:(unsigned char **)planes pixelsWide:(NSInteger)width\n​ ​ ​ ​ ​ ​\npixelsHigh:(NSInteger)height bitsPerSample:(NSInteger)bps\n​ ​ ​ ​\nsamplesPerPixel:(NSInteger)spp hasAlpha:(BOOL)alpha isPlanar:(BOOL)isPlanar\n​ ​\ncolorSpaceName:(NSString *)colorSpaceName\n​ ​\nbitmapFormat:(NSBitmapFormat)bitmapFormat bytesPerRow:(NSInteger)rowBytes\n​ ​ ​ ​\nbitsPerPixel:(NSInteger)pixelBits;\n​ ​\nIt’s almost 400 characters!\nIn iOS programming, there are over 800 classes, 9000 methods and\ngrowing. In web development, there’s a new framework every week. No one\nwill expect you to be able to remember the code. This is the precise reason\nwhy we are programmers, we can get the computer to do the boring stuff\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n13\n\nfor us. For example, the code for recording sound is only a short search\naway, why would you need to memorise it?\nThe skill that most employers look for when recruiting is the ability to think.\nKnowledge is valued in a world where information is hard to come by. In the\n1800s, only the rich had access to good books and good teachers. Now,\neveryone has all the information they had and more at the tap of a mouse.\nInformation is losing value, the ability to think is the stock to buy. So don’t\nbe afraid to search, to ask on StackOverflow or to find resources to help you\nsolve your issues. The best programmers do it.\nThe skill you need to hone is in asking good questions and understanding the\nanswer. There is no point copy-pasting code from a StackOverflow answer if\nyou have no clue how it works. Because StackOverflow works on a\nreputation system, it’s in their interest to be as clear as possible in their\nanswer in order to be marked as correct and collect upvotes.\nIn most cases, it doesn’t make sense to start searching StackOverflow\nwhenever you get stuck. The first option should always be trying to figure it\nout yourself. So your program doesn’t do what you expected it to, but before\nI typed the last 3 lines of code, it was working fine. So let’s figure out what\nin those last 3 lines broke my app?\nIf you really can’t figure it out, start with Google. Search for your query or if\nyou have a bug paste the error codes and the error message. Chances are\nthat as a beginner, your programming woes will be very common and\nsomebody might have even taken the time to write a clear and concise\ntutorial to help you understand your bug. As you grow more skilled in\nprogramming, the problems you’ll encounter get more and more obscure,\nbut hopefully, if you followed the other 11 rules, you will also be a more\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n14\n\ncapable programmer and figure it out yourself or know exactly where to get\nhelp.\nThe other reason why you should start with Google is that StackOverflow’s\nsearch algorithm organises questions and answers by recency and not\npopularity. A lot of the problems you will encounter while starting out will\nhave been asked and answered years ago but still massively popular.\nSo ask wisely and you will reap the benefits from the community. One day\nwhen you yourself become a code master, you’ll be giving back to that same\ncommunity and helping the next generation of programmers.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n15\n\n(cid:509)\nBe a Copycat\nAt the beginning of my coding journey, I thought the way to learn to code\nwas to read a whole bunch of books. I bought books on C++, C#, Java and\nloads more. You name it, I had it. But they didn’t do very much other than\nmaking me confused.\nI read. I highlighted. I forgot. I fell asleep.\nBooks are good as references. If you want to dive deep into delegates and\nprotocols, read the chapter on that. But if you want to learn, make\n​\nsomething.\n​​\nBut what do you make?\nLacking in ideas? Be a copycat. Make your own notepad, make your own\nMSPaint, make your own piano. If you’re into games, make minesweeper,\nmake Tetris, make Flappy Bird. Not only will they be sort-of useful, but\nthey’ll also be the perfect opportunity for you to figure out how to do things\nand get experience in finding help. Something that is brand new to the world\nlike holographic smartphone projections, no one will be able to help you\nwith. By making copycat apps or programs, you’ll be treading in the path\nthat many have walked before you. This way you maximise the chances that\nsomeone will be able to offer you help and advice when you get stuck.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n16\n\n(cid:510)\nBe Accountable\nBe accountable to someone. Show your work.\nThe biggest problem with online coding courses is the lack of accountability.\nNo doubt there are loads of great Massive Open Online Courses (MOOCs),\nsuch as Coursera, Udacity, Udemy, Skillshare. But what are the\nconsequences of not doing your homework or missing a month’s worth of\nlectures? Nothing. Nobody cares.\nLet’s face it, internal motivation is not strong in any of us. We can always\nfind a reason why we deserve to “Netflix and chill”. I can’t even count how\n​ ​\nmany online courses I’ve signed up to and subsequently not listened to a\nsingle lecture or completed a single piece of coursework.\nYou need accountability and commitment to learning. Think back to your\nuniversity days, would have bothered to finish that essay at 3 AM if nothing\ndepended on it? Would you have gone to any of the lectures if you didn’t\ncare about passing or failing?\nThis is why we try to introduce accountability into our courses. We’ve\nrealised that matching up students with a buddy helps. Someone else who is\na beginner, at the same level as you who sometimes helps you and other\ntimes needs your help. Sometimes, as people’s learning rates diverge or if\nyou’re paired up with a lazy bugger, you can swap it up and get a new\nbuddy. Because this system is entirely voluntary, there a degree of\nself-selection for people who work well in teams and are motivated by\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n17\n\nothers. Just as you’re more likely to go to the gym if you sign up with your\npartner, you’re more likely to learn if you have a coding buddy.\nSo if you’re not on our course then find your own. There’s plenty of\nFacebook groups dedicated to those who are learning to code. There’s an\nentire subreddit (r/learnprogramming) dedicated to this, I’m sure you’ll find\nlike-minded people somewhere online or offline.\nThe next thing I’m going to tell you will be controversial. We believe that\npeople don’t value things that don’t have a value. This is the reason why\nCoursera is taking down a large number of their free courses. They saw that\nmillions of people were signing up for it but no one was taking any of the\nclasses let alone complete any of the projects. It was actually detrimental to\nstudents’ learning to offer a free course. We all have a degree of hoarding\ntendencies and it’s very easy to signup for a bunch of stuff that the\nfuture-you can suffer through. There’s always tomorrow, she says.\nSo if you are driven more by external motivation than internal, try to use a\nlittle bit of financial motivation to drive your learning. Think about how much\na life skill is worth to you and put your money where your intentions are.\nSee if you’re engaging with the course content more with or without the\nfinancial commitment. There are plenty of places where you can pay\nsomething affordable to motivate yourself to start a regular learning habit.\nThe final part of this rule is to try and find ways of getting assessed. Ok, so\ngetting assessed is right up there with death and taxes in terms of how\nmuch people enjoy it. But when learning anything, it’s always important to\nget feedback. You will get an objective assessment of your current skill level,\ninstead of feeling like an imposter or brimming with false confidence.\nCoursera has a system where the students mark each other's’ work. At the\nApp Brewery, we use Github education to test your code and look for bugs\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n18\n\nand problems with your code. But if you’re on a coding course that doesn't\nhave a system like this, then it’ll be worth your while to find a code mentor\nwho can review your code and give you feedback. Only what’s measured can\nbe improved.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n19\n\n(cid:511)\nKeep Learning\nBeing a good programmer is a bit like being Madonna.\nDon’t run out and buy your cone-shaped bras just yet. What I mean is\nprogramming will keep evolving. In order to stay relevant, you have to keep\nre-inventing yourself.\nThere’s always new trends, new technologies and new languages. Great\nprogrammers relish in learning new things, even if it means they become a\nbeginner again.\nThe world will keep moving, if you stay in one place, you’ll eventually be left\nbehind. I know programmers who never learnt anything else apart from\nFortran. I know Objective-C programmers who can’t persuade themselves to\nmake the leap and learn Swift, even though Apple is telling developers that\nObjective-C will be phased out. We all know that Apple never makes threats\nthat they don’t carry out, just look at the optical drive (and soon the\nheadphone jack?).\nDon’t be the optical drive. Or rather, don’t be the laptop that’s still trying to\nplay CDs. If your needs change, learn to use a new tool. Keep learning, stay\nrelevant.\nAre you a web developer who always wanted to get into mobile\ndevelopment? Pick a platform and learn iOS or Android. Are you a front-end\ndeveloper who is tempted by the full-stack? Pick up web development with\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n20\n\nNode. If you already understand the core programming concepts, picking up\na few more languages will be a lot easier than starting from scratch.\n“Learn x in y minutes” is a great resource for existing programmers to learn\nnew programming languages. Check out their resources here:\nlearnxinyminutes.com\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n21\n\n(cid:512)\nPlay Foosball\nWhen you see Hollywood movies about programmers, they’re usually sat in\nfront of a laptop, mashing the keyboard like they’re in some sort of\nhigh-stakes “smash the mole” game.\nWhen you see real programmers working. They tend to look like this:\n​ ​​\nYep, that’s right. No typing. Just staring. A lot of staring.\nIn a company, people tend to complain that the programmers are always\nplaying foosball or doing something else that doesn’t look like work. People\nmight not be able to tell, but they are in fact working.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n22\n\nWhen you see them enjoying their foosball game, laughing and joking,\nthey’re probably suffering inside. For there’s a bug, there’s always a bug. Or\nthere’s something mysterious about their code that they can’t work out.\nMaybe the code is working perfectly, but unexpectedly (programmers don’t\nlike anything unexpected by the way). Like if they just typed out a thousand\nlines in one go，and unexpectedly there are no errors.\n​ ​\nOther people might not understand, but in these situations, it’s almost\nalways worth stepping away from your code and giving it some time and\ndistance.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n23\n\nDo you have a bug in your code that you can’t work out? Sleep on it, play\nfoosball, go for a walk. In 9 out of 10 cases, the solution will become\napparent. In the remaining 1 out of 10 cases, you’re just screwed.\nThis may sound unintuitive, but my advice is always to code less, think\nmore. Once the poorly thought-out code is written and brought into the\nworld, you’ll inevitably have to go back and comb through your code,\nline-by-line, refactoring and deleting things. This is always a painful\nexperience.\nSo remember, the easiest code to get rid of is the code that was never\nwritten.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n24\n\n(cid:504)(cid:503)\nGet a Mentor\nWhen I was learning French, I came across a method that resulted in the\ngreatest leap in my speaking abilities. That was having language exchanges\nover Skype. I would pair up with a native French speaker who wanted to\nlearn English. We would spend half an hour speaking French and half an\nhour speaking English. We would both dedicate an hour each week to\nimproving the language that we were trying to learn.\nWhile we were having a conversation in French, he would correct my\npronunciation or grammar and suggest the ways that I could construct my\nsentences to sound more native.\nPair programming is an agile software development technique that’s based\non very similar principles. For example, a learner and a mentor would sit\ndown at the same workstation and work on a problem. The learner is in\ncharge of writing code and the mentor reviews the code line-by-line as they\nare written.\nIt can be uncomfortable at first because it’s a bit embarrassing making\nmistakes and having them pointed out to you. But if you have a mentor who\nis a good teacher then they will offer you decades of accumulated wisdom\nthat can lead to massive improvements in your own ability, all within a few\nhours.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n25\n\nYou’ll get to tap into someone who’s had the time to hone their skills, find\nefficient ways of doing things and show you how they program and approach\nproblems.\nGood mentors don’t solve your problems, rather they practice the Socratic\nmethod of asking good questions that get you to think for yourself. If you\nask me how to write a networking call, of course, I can simply type it all out\nand get you to copy it. But that doesn’t help you. Instead, if you show me\nhow you approach the problem and I show you how I approach the problem\nthen you can learn so much more than just following a recipe.\nThe next time you encounter a different problem, you can apply the same\napproach and start solving it yourself. Always remember that information is\ncheap. A century ago, if I wanted to learn about the causes of disease, I\nprobably had to be an aristocrat, or chop wood and carry water for a master\nand become their apprentice. Nowadays I can search Google and get my\nanswer in a few seconds.\nSo don’t get hung up on information. Learn to think instead. How to\napproach a problem. How to break down the problem. How to frame the\nproblem. These skills will take you much further than simple memorisation\nand regurgitation.\nBut where do you find a mentor?\nThere are programming related Meetups happening in almost every city in\nthe world. Go to www.meetup.com and find one related to a language you’re\n​ ​\ntrying to learn. Attend the meetups, get to know people. Exchange your\nexpertise for their expertise. Maybe someone needs an accountant, maybe\nsomeone needs legal advice. Exchange your time for their time. Don’t say to\nsomeone, “will you be my mentor?”. No one wants to throw away their free\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n26\n\ntime for some stranger. Instead, offer your help in return for their help and\nyou’ll be successful in finding a mentor 95% of the time.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n27\n\n(cid:504)(cid:504)\nGet into the Habit of\nChunking\nSo you have an awesome app idea. But it’s way-way-way too complicated\nfor your current skill level. What do you do? You join the Chunking Express.\nNope, I’m not talking about the art house movie. I’m talking about breaking\ndown your programming problem.\nLet’s say that you’re trying to make a robot that can butter toast. (If anyone\nis working on one of these I’d happily fund your Kickstarter!) The robot\ndoesn't know anything about toast or butter or knives. Believe it or not, it\nactually takes pretty sophisticated circuitry in our brains to be able to\nachieve something as simple as buttering a slice of toast. (This is probably\nwhy I can’t seem to do it without coffee).\nSo creating a robot that does all of that autonomously is really complicated\nand difficult. But as we’re good programmers, we can do some chunking and\nbreak down the problem.\nThe robot doesn’t really need to know what is toast and what is butter, we’re\nnot making Skynet here, so let’s just stick to the practical things. There are\nthree things we need the robot to do:\n1. Pick up and arrange the piece of toast in the ideal buttering position.\n2. Pick up a serving of butter.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n28\n\n3. Place butter on toast with decent coverage (this is the part I find most\ndifficult).\nNext, you break each module down even further. In the process, you can\nthink about alternate ways of solving the problem. For example, does the\nrobot need to “spread” the butter? Or can it just melt the butter onto the\ntoast? Does it need to learn to pick up a knife? Or can it have some sort of\ninbuilt knife-arm, like some sort of prison shiv pirate?\nThe more that you break down problems and define the issue that you’re\ntrying to solve, the easier it is to package your code into bite-sized chunks.\nThe simpler the chunk, the easier it is to tackle.\nSo the next time that you’re trying to make that “cross between Snapchat\nand Evernote”, remember to break down the problem into solvable chunks.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n29\n\n(cid:504)(cid:505)\nBreak someone else's\ncode\nOne of the most important steps to take in order to make the jump from\nlearner coder to a fully fledged programmer is understanding how to get\nhelp. Everyone needs help. Everyone, including those so-called “God Level\nProgrammers”.\nBut what you do with the help will determine how fast you progress as a\ncoder. On a site like StackOverflow, it can be very tempting to just copy and\npaste the code that someone has provided. Your program works exactly as\nyou hoped it would and off you go on your merry programming ways. This\nexercise didn’t teach you anything other than code reliance. Because the\nnext time you encounter the same problem but in a different situation, that\nsame code snippet that someone provided may not work anymore. Then\nwhat do you do? You’re stuck.\nThat’s why there’s a rule in programming that says “never copypaste code\nthat you don’t understand”. So what should you do when you’re confronted\nwith a block of code that solves your problem but you have no clue how it\nworks? Break it down.\nStep 1 - Copy and paste the code into your program. (yes, yes, I know I just\nsaid not to do that, patience, patience).\nStep 2 - Make sure that your program or application is functioning as\nexpected. I.e. confirm that block of code really did solve your problem.\nStep 3 - Delete the copy and pasted block of code line by line.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n30\n\nStep 4 - Each time you delete a line, check to see what’s been broken. Does\nthe app still run? What are the error codes? What has deleting that line of\ncode done to your program?\nStep 5 - Even if you think you know what a line of code does, delete it\nanyway. The most important task as a programmer is to always test your\nassumptions against the outcome. For the most enjoyable feeling as a\nprogrammer is for the real world to validate your assumptions. You know\nhow nice it is when your boyfriend/girlfriend/husband/wife says those\nmagical three words?\n“You were right”.\nIt’s like that, but better.\nStep 6 - Swap some of the lines around. Can the same functionality be\nachieved with a different order of lines? Why were they written in the order\nthey were written in?\nBy breaking the solution code, line-by-line, you’ll learn and understand what\neach line does and why it’s been written. This is a far better way to use code\nfrom other people than just pasting it in and hoping for the best. Once you\nunderstand why each of those lines was necessary, the next time you\nencounter a similar problem, you’ll be able to tease out the problem and\nsolve it yourself.\nOnce you’ve mastered breaking code from StackOverflow, the next resource\nto target is GitHub. It’s a tool used by programmers for collaboration but it is\nalso one of the largest repositories of open source code.\nSo how can you use it to become a better programmer? Let’s say that you\nwant to make an Instagram clone. But unfortunately, you don’t know how to\ndo that. So you head over to github.com and search “Instagram” or “photo\napp”.\nInevitably, there will be something written in Swift/Objective-C/Java that\nyou can download and take a look at.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n31\n\nThink about the structure of their program. Take a look at all the classes,\nthe constants, the interplay. Make some modifications to the code. Does it\nstill work or have you broken it? Why did you break it? Is there a link that\nyou didn’t identify? Ask yourself a bunch of questions, learn through the\nSocratic method. Tear down the project and understand how it was built.\nWhen you start getting really good at this, the next thing you can try is\nreverse engineering. Find a small project on GitHub made by a reputable\nprogrammer, download the app. Run it and see all of its functionality. Play\naround with it.\nThen build it from scratch and once you’re done, compare your code to their\ncode. Are there efficiency gains that you could have made? Are there\nsolutions to things you couldn’t figure out? Now you’re really getting into the\nbig leagues.\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n32\n\nThat’s all for now folks. What are you still waiting for? The night’s still\nyoung! Code something, make something, learn something today! Head over\nto www.appbrewery.co to jump start your coding journey!\n​ ​\nwww.appberwery.co\nAll rights reserved © The App Brewery\nwww.appbrewery.co\n33",
    "3. Coding Notebook Sheets to Print.pdf": "111000000 DDDAAAYYYSSS\nConcept: Day:\nOOOFFF PPPYYYTTTHHHOOONNN\nFilename: #Comments\n01\n02\n03\n04\n05\n06\n07\n08\n09\n10\n11\n12\n13\n14\n15\n16\n17\n18\nLecture:\nSummary:\n100daysofpython.dev\n\n111000000 DDDAAAYYYSSS\nConcept: Day:\nOOOFFF PPPYYYTTTHHHOOONNN\nFilename: #Comments\n01\n02\n03\n04\n05\n06\n07\n08\n09\n10\n11\n12\n13\n14\n15\n16\n17\n18\nLecture:\nSummary:\n100daysofpython.dev",
    "3. Python Syntax Cheat Sheet Booklet v2.pdf": "P Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nBASICS\nPrint\nPrints a string into the console. print(\"Hello World\")\nInput\nPrints a string into the console, input(\"What's your name\")\nand asks the user for a string input.\nComments\nAdding a # symbol in font of text #This is a comment\nlets you make comments on a line of code. print(\"This is code\")\nThe computer will ignore your comments.\nVariables\nA variable give a name to a piece of data. my_name = \"Angela\"\nLike a box with a label, it tells you what's my_age = 12\ninside the box.\nThe += Operator\nThis is a convient way of saying: \"take the my_age = 12\nprevious value and add to it. my_age += 4\n#my_age is now 16\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nDATA TYPES\nIntegers\nIntegers are whole numbers. my_number = 354\nFloating Point Numbers\nFloats are numbers with decimal places. my_float = 3.14159\nWhen you do a calculation that results in\na fraction e.g. 4 ÷ 3 the result will always be\na floating point number.\nStrings\nA string is just a string of characters. my_string = \"Hello\"\nIt should be surrounded by double quotes.\nString Concatenation\nYou can add strings to string to create \"Hello\" + \"Angela\"\na new string. This is called concatenation. #becomes \"HelloAngela\"\nIt results in a new string.\nEscaping a String\nBecause the double quote is special, it speech = \"She said: \\\"Hi\\\"\"\ndenotes a string, if you want to use it in print(speech)\na string, you need to escape it with a \"\\\"\n#prints: She said: \"Hi\"\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nF-Strings\ndays = 365\nYou can insert a variable into a string\nusing f-strings. print(f\"There are {days}\nThe syntax is simple, just insert the variable in a year\")\nin-between a set of curly braces {}.\nConverting Data Types\nYou can convert a variable from 1 data n = 354\ntype to another. new_n = float(n)\nConverting to float:\nprint(new_n) #result 354.0\nfloat()\nConverting to int:\nint()\nConverting to string:\nstr()\nChecking Data Types\nn = 3.14159\nYou can use the type() function\nto check what is the data type of a type(n) #result float\nparticular variable.\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nMATHS\nArithmetic Operators\nYou can do mathematical calculations with 3+2 #Add\nPython as long as you know the right\n4-1 #Subtract\noperators.\n2*3 #Multiply\n5/2 #Divide\n5**2 #Exponent\nThe += Operator\nThis is a convenient way to modify a variable. my_number = 4\nIt takes the existing value in a variable my_number += 2\nand adds to it.\n#result is 6\nYou can also use any of the other\nmathematical operators e.g. -= or *=\nThe Modulo Operator\nOften you'll want to know what is the 5 % 2\nremainder after a division. #result is 1\ne.g. 4 ÷ 2 = 2 with no remainder\nbut 5 ÷ 2 = 2 with 1 remainder\nThe modulo does not give you the result\nof the division, just the remainder.\nIt can be really helpful in certain situations,\ne.g. figuring out if a number is odd or even.\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nERRORS\nSyntax Error\nSyntax errors happen when your code print(12 + 4))\ndoes not make any sense to the computer.\nFile \"<stdin>\", line 1\nThis can happen because you've misspelt\nprint(12 + 4))\nsomething or there's too many brackets or\n^\na missing comma.\nSyntaxError: unmatched ')'\nName Error\nmy_number = 4\nThis happens when there is a variable\nwith a name that the computer my_Number + 2\ndoes not recognise. It's usually because Traceback (most recent call\nyou've misspelt the name of a variable\nlast): File \"<stdin>\", line 1,\nyou created earlier.\nNameError: name 'my_Number'\nNote: variable names are case sensitive!\nis not defined\nZero Division Error\n5 % 0\nThis happens when you try to divide by zero,\nThis is something that is mathematically Traceback (most recent call\nimpossible so Python will also complain. last): File \"<stdin>\", line 1,\nZeroDivisionError: integer\ndivision or modulo by zero\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nFUNCTIONS\nCreating Functions\ndef my_function():\nThis is the basic syntax for a function in\nprint(\"Hello\")\nPython. It allows you to give a set of\nname = input(\"Your name:\")\ninstructions a name, so you can trigger it\nmultiple times without having to re-write print(\"Hello\")\nor copy-paste it. The contents of the function\nmust be indented to signal that it's inside.\nCalling Functions\nmy_function()\nYou activate the function by calling it.\nmy_function()\nThis is simply done by writing the name of\n#The function my_function\nthe function followed by a set of round\nbrackets. This allows you to determine #will run twice.\nwhen to trigger the function and how\nmany times.\nFunctions with Inputs\ndef add(n1, n2):\nIn addition to simple functions, you can\ngive the function an input, this way, each time print(n1 + n2)\nthe function can do something different\ndepending on the input. It makes your\nadd(2, 3)\nfunction more useful and re-usable.\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nFunctions with Outputs\ndef add(n1, n2):\nIn addition to inputs, a function can also have\nan output. The output value is proceeded by return n1 + n2\nthe keyword \"return\".\nThis allows you to store the result from a\nresult = add(2, 3)\nfunction.\nVariable Scope\nn = 2\nVariables created inside a function are def my_function():\ndestroyed once the function has executed.\nn = 3\nThe location (line of code) that you use\nprint(n)\na variable will determine its value.\nHere n is 2 but inside my_function() n is 3.\nSo printing n inside and outside the function\nprint(n) #Prints 2\nwill determine its value.\nmy_function() #Prints 3\nKeyword Arguments\ndef divide(n1, n2):\nWhen calling a function, you can provide result = n1 / n2\na keyword argument or simply just the\n#Option 1:\nvalue.\ndivide(10, 5)\nUsing a keyword argument means that\nyou don't have to follow any order #Option 2:\nwhen providing the inputs.\ndivide(n2=5, n1=10)\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nCONDITIONALS\nIf\nn = 5\nThis is the basic syntax to test if a condition if n > 2:\nis true. If so, the indented code will be\nprint(\"Larger than 2\")\nexecuted, if not it will be skipped.\nElse\nage = 18\nThis is a way to specify some code that will be if age > 16:\nexecuted if a condition is false.\nprint(\"Can drive\")\nelse:\nprint(\"Don't drive\")\nElif\nweather = \"sunny\"\nIn addition to the initial If statement\ncondition, you can add extra conditions to if weather == \"rain\":\ntest if the first condition is false. print(\"bring umbrella\")\nOnce an elif condition is true, the rest of\nelif weather == \"sunny\":\nthe elif conditions are no longer checked\nprint(\"bring sunglasses\")\nand are skipped.\nelif weather == \"snow\":\nprint(\"bring gloves\")\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nand\ns = 58\nThis expects both conditions either side if s < 60 and s > 50:\nof the and to be true.\nprint(\"Your grade is C\")\nor\nage = 12\nThis expects either of the conditions either if age < 16 or age > 200:\nside of the or to be true. Basically, both\nprint(\"Can't drive\")\nconditions cannot be false.\nnot\nif not 3 > 1:\nThis will flip the original result of the\ncondition. e.g. if it was true then it's now print(\"something\")\nfalse. #Will not be printed.\ncomparison operators\n> Greater than\nThese mathematical comparison operators\nallow you to refine your conditional checks. < Lesser than\n>= Greater than or equal to\n<= Lesser than or equal to\n== Is equal to\n!= Is not equal to\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nLOOPS\nWhile Loop\nn = 1\nThis is a loop that will keep repeating itself while n < 100:\nuntil the while condition becomes false.\nn += 1\nFor Loop\nall_fruits = [\"apple\",\nFor loops give you more control than \"banana\", \"orange\"]\nwhile loops. You can loop through anything\nfor fruit in all_fruits:\nthat is iterable. e.g. a range, a list, a dictionary\nprint(fruit)\nor tuple.\n_ in a For Loop\nfor _ in range(100):\nIf the value your for loop is iterating through,\ne.g. the number in the range, or the item in #Do something 100 times.\nthe list is not needed, you can replace it with\nan underscore.\nbreak\nscores = [34, 67, 99, 105]\nThis keyword allows you to break free of the\nloop. You can use it in a for or while loop. for s in scores:\nif s > 100:\nprint(\"Invalid\")\nbreak\nprint(s)\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\ncontinue\nn = 0\nwhile n < 100:\nThis keyword allows you to skip this iteration\nn += 1\nof the loop and go to the next. The loop will\nif n % 2 == 0:\nstill continue, but it will start from the top.\ncontinue\nprint(n)\n#Prints all the odd numbers\nInfinite Loops\nwhile 5 > 1:\nSometimes, the condition you are checking print(\"I'm a survivor\")\nto see if the loop should continue never\nbecomes false. In this case, the loop will\ncontinue for eternity (or until your computer\nstops it). This is more common with while\nloops.\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nLIST METHODS\nAdding Lists Together\nlist1 = [1, 2, 3]\nYou can extend a list with another list by list2 = [9, 8, 7]\nusing the extend keyword, or the + symbol.\nnew_list = list1 + list2\nlist1 += list2\nAdding an Item to a List\nall_fruits = [\"apple\",\nIf you just want to add a single item to a \"banana\", \"orange\"]\nlist, you need to use the .append() method.\nall_fruits.append(\"pear\")\nList Index\nletters = [\"a\", \"b\", \"c\"]\nTo get hold of a particular item from a\nlist you can use its index number. letters[0]\nThis number can also be negative, if you #Result:\"a\"\nwant to start counting from the end of the\nletters[-1]\nlist.\n#Result: \"c\"\nList Slicing\n#list[start:end]\nUsing the list index and the colon symbol\nyou can slice up a list to get only the letters = [\"a\",\"b\",\"c\",\"d\"]\nportion you want. letters[1:3]\nStart is included, but end is not.\n#Result: [\"b\", \"c\"]\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nBUILT IN FUNCTIONS\nRange\n# range(start, end, step)\nOften you will want to generate a range\nfor i in range(6, 0, -2):\nof numbers. You can specify the start, end\nprint(i)\nand step.\nStart is included, but end is excluded:\nstart <= range < end\n# result: 6, 4, 2\n# 0 is not included.\nRandomisation\nimport random\nThe random functions come from the\n# randint(start, end)\nrandom module which needs to be\nn = random.randint(2, 5)\nimported.\nIn this case, the start and end are both #n can be 2, 3, 4 or 5.\nincluded\nstart <= randint <= end\nRound\nThis does a mathematical round.\nSo 3.1 becomes 3, 4.5 becomes 5 round(4.6)\nand 5.8 becomes 6. # result 5\nabs\nThis returns the absolute value.\nBasically removing any -ve signs. abs(-4.6)\n# result 4.6\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nMODULES\nImporting\nimport random\nSome modules are pre-installed with python\nn = random.randint(3, 10)\ne.g. random/datetime\nOther modules need to be installed from\npypi.org\nAliasing\nimport random as r\nYou can use the as keyword to give\nn = r.randint(1, 5)\nyour module a different name.\nImporting from modules\nfrom random import randint\nYou can import a specific thing from a n = randint(1, 5)\nmodule. e.g. a function/class/constant\nYou do this with the from keyword.\nIt can save you from having to type the same\nthing many times.\nImporting Everything\nfrom random import *\nYou can use the wildcard (*) to import\neverything from a module. Beware, this list = [1, 2, 3]\nusually reduces code readability. choice(list)\n# More readable/understood\n#random.choice(list)\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nCLASSES & OBJECTS\nCreating a Python Class\nclass MyClass:\nYou create a class using the class keyword.\n#define class\nNote, class names in Python are PascalCased.\nSo to create an empty class (cid:0)\nCreating an Object from a Class\nclass Car:\nYou can create a new instance of an object pass\nby using the class name + ()\nmy_toyota = Car()\nClass Methods\nclass Car:\nYou can create a function that belongs def drive(self):\nto a class, this is known as a method.\nprint(\"move\")\nmy_honda = Car()\nmy_honda.drive()\nClass Variables\nclass Car:\nYou can create a varaiable in a class. colour = \"black\"\nThe value of the variable will be available\ncar1 = Car()\nto all objects created from the class.\nprint(car1.colour) #black\nwww.appbrewery.com\n\nP Y T H O N C H E A T S H E E T\n100 DAYS OF CODE\nCOMPLETE PROFESSIONAL\nPYTHON BOOTCAMP\nThe __init__ method\nclass Car:\nThe init method is called every time a new def __init__(self):\nobject is created from the class.\nprint(\"Building car\")\nmy_toyota = Car()\n#You will see \"building car\"\n#printed.\nClass Properties\nclass Car:\nYou can create a variable in the init() of\na class so that all objects created from the def __init__(self, name):\nclass has access to that variable. self.name = \"Jimmy\"\nClass Inheritance\nclass Animal:\nWhen you create a new class, you can def breathe(self):\ninherit the methods and properties\nprint(\"breathing\")\nof another class.\nclass Fish(Animal):\ndef breathe(self):\nsuper().breathe()\nprint(\"underwater\")\nnemo = Fish()\nnemo.breathe()\n#Result:\n#breathing\n#underwater\nwww.appbrewery.com",
    "3. Syllabus for 100 Days of Python.pdf": "S Y L L A B U S BEGINNER PYTHON\nVariables in Python\n100 DAYS OF CODE String Manipulation\nInput and Print Functions\nCOMPLETE\nVariable Naming Rules\nPROFESSIONAL\nMathematical Operations in Python\nPYTHON BOOTCAMP DataTypes\nConverting types\nConditionals IF/ELIF/ELSE\nLogical Operators\nRandomisation\nError Handling\nFunctions\nFor Loops\nCode blocks and Indentation\nWhile Loops\nFlowchart Programming\nPositional and Keyword Arguments\nPython Dictionaries and Lists\nNested Collections\nReturning Functions\nReturn vs. Print\nDoc Strings vs. Comments\nScope and Local/Global Variables\nDebugging Techniques\nINTERMEDIATE PYTHON\nLocal Development Environment Setup\nPyCharm Tips and Tricks\nPython Object Oriented Programming\nCreating Classes in Python\nUsing External Python Modules/Import\nGetting / Setting Attributes\nPython Methods\nClass Initialisers\nModule Aliasing\nOptional, Required and Default Parameters\nEvent Listenters\nPython Instances and State\nPython Turtle\nGame Development with Python and OOP\nPython Inheritance\nPython Slice Function\nFile I/O Reading and Writing to Local Files\nFile Directories\nReading and Writing to CSV\nIntroduction to the Pandas Framework\nAPP BREWERY\nList Comprehensions\nDictionary Comprehensions\nwww.appbrewery.co\n\nS Y L L A B U S Packing and Unpacking Functions in Python\nCreating Desktop GUI Apps with Tkinter\nStrongly Dynamic Typing\n100 DAYS OF CODE\nError Handling and Exceptions\nCOMPLETE Try / Except/ Raise\nWorking with JSONs\nPROFESSIONAL\nLocal Persistence\nPYTHON BOOTCAMP\nSending Email with Python and SMTP\nWorking with date and time\nHosting Python Code Online with PythonAnywhere\nINTERMEDIATE +\nAPIs\nMaking HTTP Requests with the Requests module\nSending Parameters with the Request\nAPIs with Authentication\nSending SMS with Python\nWeb Scraping with Beautiful Soup\nBrowser Automation with Selenium Web Driver\nAutomating Tinder\nAutomating Twitter\nAutomating LinkedIn\nAutomating Instagram\nWeb Development with Flask\nCommand Line\nPython Decorators\nTemplating with Jinja 2\nWTForms\nADVANCED PYTHON\nBuild Your Own REST API with Python\nBuild Your Own Blog\nDatabases with SQLite\nDataframe Inspection\nData Cleaning\nSorting Values in Dataframes\nArithmatic Operations with Pandas\nCreating Pivot Tables\nChaining Functions\nSmoothing Time Series Data\nCreating Line Charts with Matplotlib\nUsing Jupyter Notebook\nHTML Markdown\nCreating Scatterplots with Matplotlib\nRelational Database Schemas\nDescriptive Statistics\nAPP BREWERY\nCreating Bar Charts, Pie Charts, Donut Charts, Box Plots with\nPlotly\nwww.appbrewery.co\nCreating NumPy NDArrays\n\nS Y L L A B U S Array Slicing and Subsetting\nMatrix Multiplication\nBitwise and Operators in Pandas\n100 DAYS OF CODE\nCreating Bubble Charts with Seaborn\nCOMPLETE Running Regressions with Scikit-Learn\nNon-Parametric Regression\nPROFESSIONAL\nStudents T-Tests and Histograms with Scikit-Learn\nPYTHON BOOTCAMP\nMulti-Variable Regression\nLog Transformations\nResiduals Analysis\nPROFESSIONAL PORTFOLIO\nBUILDING INDEPENDENT\nASSIGNMENTS\nText to Morse Code Converter\nPortfolio Website\nTic Tac Toe Game\nImage Watermarking App\nTyping Speed Test\nBreakout Game\nCafe and Wifi Website\nTodo List Website\nDisappearing Text Writing App\nImage Color Palette Generator\nCustom Web Scraper\nAutomating the Google Dinosaur Game\nSpace Invaders Game\nCustom API Driven Website\nAn Online Shop\nCustom Browser Automation\nAnalyse and Visualise the Space Race\nAnalyse Deaths Involving the Police in the US\nPredict Earnings using Multivariable Regression\nAPP BREWERY\nwww.appbrewery.co"
  },
  "vtts": {
    "1. What you're going to get from this course.en_US.vtt": "Hello and welcome to the world's best Python bootcamp!\n\nMy name is Angela 👩🏻‍🏫\n\nI'm a Senior Developer and the lead instructor at the App Brewery,\n\nLondon's highest-rated programming bootcamp. To date,\n\nI've taught over a half a million students in-person and online,\n\nand I'm so excited to be your instructor on this course.\n\nAs a student on this course,\n\nyou're going to get access to over 56 hours of HD video content,\n\nwhich contains step-by-step tutorials, interactive, coding exercises,\n\nquizzes, and more.\n\nThe course is structured around the #100DaysOfCode challenge.\n\nSo you can look forward to a 100 days of lovingly crafted content that is\n\ngoing to cover every aspect of Python programming from Web Development to Data\n\nScience.\n\nIt's the only course you need to become a professional Python developer. Every day\n\non the course, you are going to use what you've learned to build a new project.\n\nYou'll build a bot 🤖 that texts you in the morning. If it will rain ☔️ that day.\n\nSo you never forget your umbrella again.\n\nYou'll build classic arcade games 👾 like Snake and Pong to impress your friends 😮\n\nby challenging them to a game that *you* built.\n\nYou'll learn to make sense of complex data and create beautiful visualizations\n\nto impress your colleagues at work.\n\nYou'll create a program that automatically sends \"Happy Birthday\" emails to your\n\nfriends and family. Never forget mom's birthday 🎂 again!\n\nYou'll work on projects that clone real-world startups. Cheap flight club: check ✅.\n\nBuild your own blog: check ✅. Twitter bot: check ✅.\n\nAnd there are so many more projects waiting to be discovered by you!\n\n100 projects in total.\n\nSo if you are somebody who wants to get a job as a Python developer,\n\nthen this is perfect for building up your portfolio to show off at your next\n\ninterview.\n\nNow, this course assumes absolutely no prior programming experience.\n\nSo if you are somebody who's never coded before,\n\nI'll be with you every step of the way as I take you from programming\n\nfundamentals through to more intermediate and advanced programming concepts.\n\nYou're going to learn Python from scratch. Now,\n\nif you are an advanced developer 👨‍💻 on the other hand then take a look at the\n\ncurriculum and start at the level that suits you best. From beginner to\n\nprofessional, every level is covered in the course. Got school?\n\nWorking a full-time job? Have to look after kids? I know you're busy.\n\nI've ⏳ timed each day of the course,\n\nto take less than 2 hours to complete.\n\nSo you can fit the course around your life.\n\nThis course has exactly the same curriculum as our in-person programming\n\nbootcamp. So instead of spending thousands of dollars and taking time off work,\n\nyou will get access to\n\nexactly the same curriculum with years of design and testing behind it to insure\n\nthat you don't just know what to do, but also why you're doing it. Now,\n\ndon't just take my word for it.\n\nCheck out what my past students had to say about my courses.\n\nSo what do you still waiting for?\n\nFind out why over half a million students have rated my course ⭐️⭐️⭐️⭐️⭐️ stars and see\n\nwhat *you* can do by mastering Python 🐍!",
    "10. The Python Input Function.en_US.vtt": "",
    "11. Python Variables.en_US.vtt": "Now, in this lesson, I want to talk to you about Python variables,\n\nand it's a really, really useful concept.\n\nThe first thing I want to do is to take a look at this line of code that you should have already, and\n\nwhen we run this, we should be pretty familiar with what happens, right?\n\nIt will ask us for our name and when we hit Enter, nothing happens,\n\nbut behind the scenes, this name or this input has now been received by this function.\n\nBut once that's done, it kind of just disappears, right?\n\nAnd there's no way for us to be able to refer to it in the future.\n\nOr is there?\n\nWell, this is where variables come in really handy,\n\nif I give the result of this action, a name, well,\n\nthen I'll be able to refer to it later on.\n\nSo at the beginning of the line, I'm going to call it name, and then I'm going to add an equal sign,\n\nand what this does is it assigns whatever it is that the user typed in as the input to this prompt to\n\na variable called name.\n\nSo now if I go ahead and run my code again and I enter a name.\n\nNow, once I hit Enter, normally there's no way for me to get hold of this anymore, right?\n\nBut now I can actually go ahead and write\n\nprint,\n\nI'm going to print the value of this variable name.\n\nSo now if I run my code and I write a name, hit Enter,\n\nyou'll see that this gets printed.\n\nAnd I can use this at any point in my code just by referring to the name that's attached to this value.\n\nSo it's almost like we've saved the data from this action to a name.\n\nAnd if you think about it, if you had a phone book, let's say, and you just jotted down the numbers\n\nof people, the next time you look at this, there's no way for you to know whose number that is, right?\n\nIn a sense, it's the same thing with the computer,\n\neven though we've inputted this piece of data, there's no way for us to be able to refer to this data\n\nunless we give it a name.\n\nSo in our phone book, we might say that this particular number is associated with the name James.\n\nAnd in programming, we would call this name, james, a variable.\n\nSo we could write something like James =, and then his phone number.\n\nAnd this means that in the future, if we ever need this piece of data, we can just refer to it by\n\nits name,\n\nthe variable name of james.\n\nNow, as the name variable suggests, it's something that can be changed or can be varied.\n\nSo for example, just because this name is set to something up here doesn't mean that I can't change\n\nit later on.\n\nSo to make things simple, let's go ahead and delete the input() function,\n\nand let's just say name is equal to jack. print(\"name\").\n\nWhen I run that, jack is what gets printed inside the console, because I'm now referring to that piece\n\nof data by the variable name.\n\nBut if later on I decide to give this variable a different piece of data to hold on to, let's say,\n\nAngela, and I print(name) at this time point after I've changed it,\n\nwhat do you think these two lines will print?\n\nWhat do you think will first be printed?\n\nWhat do you think will be printed second?\n\nSo even though they're both printing the same variable at this point, when we first call print, it's\n\nholding on to the value of jack,\n\nbut by Line 5, I've now changed it so that it's holding on to the value of Angela.\n\nSo to practice that, I have a challenge for you.\n\nSo I want you to be able to figure out how many characters are in the name that the user types in using\n\nthe input() function. So you already know how the input function works,\n\nyou already know how to get the user to enter it, and then to get that data back into our code and\n\nprint it out,\n\nbut here's the extra step,\n\n\"Can you calculate how many characters there are in the name that they type in?\"\n\nFor example, if they typed in jack, that would be four.\n\nIf they typed in Angela that would be six.\n\nNow how do we figure out things when we're programming and we're trying to do something that we haven't\n\ndone before?\n\nWell, one of the most important skills as a programmer is to be able to use Google well.\n\nIt's to be able to find the answers that you need because it's inevitable that you won't remember\n\nevery single function and you won't know every single function.\n\nSo we need to read documentation and we need to know how to get hold of it.\n\nSo very simple,\n\nwe start off with our query, \"how to find the length of a string.\"\n\nAnd then we add our programming language because this will be different in every programming language.\n\nSo I normally just add Python to the end of it.\n\nAnd then once we hit Enter, normally we'll get hold of some form of documentation,\n\nand the W3Schools documentation for Python is not bad.\n\nAnd you can also browse through all of the other examples.\n\nSo normally for Python, I stick to W3Schools or StackOverflow,\n\nand both of these will give you the right answer.\n\nBut if we are reading documentation then you can see that normally there is a whole bunch of other things\n\nthat we can look up, just like a dictionary of Python.\n\nNow, as you wouldn't start with a dictionary when you're learning a new language,\n\nbelieve me, I tried that,\n\nit did not work,\n\nyou also wouldn't want to learn through everything in the documentation because it's very dry.\n\nAnd when you don't have a real-life application, when you're not trying to use a particular function\n\nor some sort of component, then you also don't remember it very well.\n\nSo I recommend to find what you need when you need it,\n\nand our brain is for thinking and not for storing,\n\nbecause these days, as you know, it's super cheap to buy a single terabyte, storage hard disk\n\nonline.\n\nI think it costs something like 10 or $20 and it's just getting cheaper every day.\n\nSo don't use your brain to store things,\n\nuse it to think.\n\nBut coming back to our documentation here, in order to get the Python string length, we use the len()\n\nfunction.\n\nAnd just like the print() function, it's an inbuilt function in Python,\n\nso we can simply just write len(),\n\nand then we can use whatever it is we want to measure.\n\nFor example, in this case it's, \"Hello world!\" and it will output the number of characters in that string.\n\nSo now give it a go yourself.\n\nSo the pause one is the instruction set.\n\nAnd I want you to get user input.\n\nI want you to take that user input and calculate the length of the string that the user inputted,\n\nand finally to print that number out into the output area.\n\nAnd everything could be done in just one line of code.\n\nSo try to find the documentation, try to figure out how to do this, and I'll see you on the other\n\nside where we run through the solution.\n\nSo pause the video now.\n\nAll right.\n\nSo referring to the documentation it's pretty straightforward.\n\nThe first thing we're going to do is we're going to get hold of the input.\n\nSo we know the input function looks like this,\n\nand we can add in whatever prompt we want.\n\nSo what is your name?\n\nAnd then we're going to wrap this input inside another set of parentheses.\n\nAnd you can do that without having to type open and closing brackets,\n\nif you just highlight the entire line you want to wrap and then type the open bracket,\n\nand it should wrap everything inside.\n\nSo the next step is to calculate the length which is using the len() function that we just heard about.\n\nAnd then finally I'm going to wrap everything in just one more bracket,\n\nand this one is the print() function.\n\nSo the three steps are we get hold of the user input,\n\nwe calculate the number of characters in that input,\n\nand then finally we print it out into the output area.\n\nSo now let's go ahead and run our code.\n\nSo first line that comes out is these two print statements from before.\n\nAnd then the third line asks me what is my name.\n\nAnd you can see the process is paused, waiting for me to type that in.\n\nAnd then once I hit Enter, that name is going to replace this part of our code and it's going to calculate\n\nthe length.\n\nAnd then finally that length is going to be printed and we get 6, which is correct.\n\nThat's the number of characters in my name.\n\nSo hopefully you've learned a little bit about documentation and also search.\n\nAnd also the importance of being able to get your own answers as a programmer.\n\nSo now I have another coding challenge for you.\n\nCan you use what you've learned about creating variables and using variables in order to take these\n\ntwo parts, the input() function, and the output of the len() function and store them in separate variables.\n\nSo there should be a variable called username that will store whatever the user enters into the input\n\narea.\n\nAnd then using that variable you're going to create a variable called length to calculate the length\n\nof the username.\n\nSo then instead of this combined print statement, we can end up with simply just printing length at the\n\nend.\n\nSo that way we can get the same result as this,\n\nbut we use several steps to get there by creating and using some variables.\n\nSo give this a try.\n\nPause the video and if it doesn't work, come back and we'll go through the solution together.\n\nOkay.\n\nSo the first step is we're going to create our first variable which is called username.\n\nAnd this is simply going to be set to store whatever the user types into the input.\n\nAnd that will get stored under this reference username.\n\nAnd then we're going to use that to calculate the length of the username.\n\nBut instead of putting the input into the length, we can now refer to it using our variable name, username.\n\nSo now we can print this new variable that we created on Line 9 and through these three steps, we've\n\nmade this one single line code hopefully a little bit easier to understand.\n\nSo we get the username from the input,\n\nwe calculate the length from the username,\n\nand then finally we print the length.\n\nAnd when we hit Run you'll see exactly the same thing happens.\n\nWe get the same code.\n\nNow at this point, you might be wondering to yourself what exactly is the point of variables?\n\nWe've just turned one very, very short line into three very long lines.\n\nNow, of course, we're working with very, very simple examples here.\n\nAnd it might be hard to see the exact use case, but as things get more complicated, you will be glad\n\nto know how to use variables.\n\nEven in this simple situation, you can see that instead of this line of code, having these three lines\n\nof code makes our code a lot more readable\n\nbecause we're labelling each step of our code, we're saying, well, from this line of code, we're\n\ngoing to get hold of the username, from this line of code, we're going to work out the length of the\n\nusername.\n\nAnd then finally we're going to use that final variable and print it out.\n\nNow as things get more complex, and being able to split up code into smaller modules will become a\n\nlifesaver.\n\nSo in the next lesson, I've got a coding exercise for you and hopefully through more and more examples,\n\nyou'll see just how useful variables can be.\n\nRight now, bear with me and just try to learn to create variables and use variables,\n\nand I promise it's going to all become very, very clear very soon just how useful they are.",
    "13. Variable Naming.en_US.vtt": "Now, when it comes to naming your variables, you can pretty much call it whatever it is you want.\n\nSo instead of calling this name, I could have just called it n, and I could have called this l, and\n\nas long as I'm consistent,\n\nso if I wanted to get the length of n, then I would have to change this as well.\n\nAnd if I wanted to print out l, then I have to change this as well.\n\nBut there's a couple of rules that you should probably follow,\n\nand the most important one is to make your code readable.\n\nBecause if you come back to this in 6 months, 12 months, n and l is not going to have a lot of meaning\n\nfor you.\n\nSo try to make sure that it actually makes sense to you.\n\nAnd if you want to, you can actually have multiple words in the name of your variable.\n\nSo for example, if you wanted to call this username, then you would write the word user, and then\n\nyou would separate each of the words with an underscore.\n\nBut you can't have a space in between.\n\nThis is not valid code.\n\nAnd if you try to run it, you'll get a SyntaxError.\n\nSo the name of the variable has to be one single unit.\n\nAnd in order to separate words in Python we use the underscore.\n\nNow if you want to use numbers in the name of your variable you can.\n\nSo for example length1, length2,\n\nbut they can't be at the beginning of the name of the variables.\n\nSo you can't say 1length, or 3length.\n\nThat will generate a syntax error as well.\n\nFinally, there's certain privileged words that we use,\n\nfor example, the names of our functions like print and input.\n\nAnd it's usually good practice to not use them as the names of your variables, because you can see\n\nthat syntax highlighting gets messed up because it thinks that it's actually input() function you're trying\n\nto create.\n\nAnd even though often when you run your app it might not have any issues, this is really bad practice\n\nbecause it's very confusing.\n\nSo try to make sure that all the names of your variables get highlighted like the other variables in\n\nthe same color.\n\nNow, the final thing to remember is that if you decide to call your variable this particular name, N-A-M-E,\n\nand at a later point, you make a typo and you spell it wrong,\n\nso maybe instead of name, you said, nama, this is not going to work.\n\nAnd when you run your code, you'll get what's called a NameError because it says this name is not\n\ndefined.\n\nAnd the idea is that you would look at where the error is,\n\nLine 2, print nama, and you'll see, \"Oh, that's not right.\"\n\nIt's meant to be spelled, N-A-M-E, so you'll have to go and fix it in order for your code to work.\n\nNow remember that this is not because Python is doing any sort of spell checking for you.\n\nIt's like, \"Oh, that's not how you spell name.\"\n\nNo.\n\nIn fact, if you decided to call this nama, and you later on use it as nama, there's no problems. Other\n\nthan this green squiggly underline which tells you that there is a typo in this word,\n\nPython doesn't actually care, and that's why your file is still checked because very often you might\n\nbe in the situation where you need to create something that is unique, right?\n\nYou might have a player in your video game called Nama and you decide to call it that.\n\nIt's totally up to you.\n\nAnd the only thing that Python really cares about is that you are consistent.\n\nThis is the name that's associated with this piece of data,\n\nlater on, when you want to use this piece of data, you use this name to refer to it.\n\nAnd as long as these two spellings are identical, then the computer doesn't care at all.\n\nSo when you get a NameError in your code, you now know it's probably because you've misspelled or\n\nmistyped one of the variable names somewhere in your code.\n\nNow, in the next lesson, I've prepared a quiz for you where you'll get to select which variable names\n\nare valid, and which ones are not\n\ngood practice.\n\nHave a go at that over on the next lesson.",
    "15. Day 1 Project Band Name Generator.en_US.vtt": "All right, guys, it's time for the final project of today.\n\nSo the program that you're going to be building looks a little bit like this.\n\nAnd you can check it out if you head over to this link, either by typing it in or heading to the Course\n\nResources page and clicking on the corresponding link.\n\nBut essentially, it's a Band Name Generator, and it asks you for a city that you grew up in and the\n\nname of your pet, and then it combines those together and gives you the name of your band.\n\nThere's a couple of things to note here.\n\nFirstly is notice when this input got triggered, the cursor actually showed up on a new line.\n\nSo if I run this again, you can see it says, \"What's the name of the city you grew up in?\"\n\nAnd then the cursor is on the next line.\n\nAnd what I want you to do is to go ahead and head over to this stunning project.\n\nSo there's a couple of steps in here as hints.\n\nBut the important thing is, once you've completed this project, it should work exactly the same as\n\nthe one that you see here.\n\nAnd in order to do this, you're going to have to apply everything that you learned today, including\n\nprinting inputs, variables, new lines, string manipulation, debugging, and a whole lot more.\n\nSo this is the time to grab yourself a cup of tea or coffee, pause the video, and tackle this final\n\nproject.\n\nAll right guys, I hope you gave that a go and you were able to complete it.\n\nIf you want to see how I've implemented it, or if you want to, just check to see if you have any errors\n\nor if there's something that you're unsure about, then continue watching and I'll go through\n\nthe solution with you.\n\nThe first step is to create a greeting for your program.\n\nIn our case, it says, Welcome to the Band Name Generator,\n\nso that's exactly what I'm going to create.\n\nAnd we print these messages using the print() function.\n\nSo I'm going to say, \"Welcome to the Band Name Generator.\"\n\nAnd this when I run it will just print that message.\n\nNow the next step is to ask the user for the city that they grew up in.\n\nSo in order to get some input from the user, we'll need of course the input() function.\n\nAnd we're going to ask them using the prompt which goes inside the parentheses,\n\n\"Which city did you grow up in?\"\n\nSo now when I hit run it's going to ask me for the city that I grew up in and I'm able to add a reply\n\nlike so.\n\nNow that data is just going to be lost to thin air unless I capture it and I give it a name.\n\nSo I'm going to have to create a variable to hold on to the data that the user inputted.\n\nSo we'll just call that city and then add the equal sign to assign whatever it is that the user typed\n\nin to this variable name.\n\nAnd now I have access to this city variable, and I can print it or use it later on if I want to,\n\nlike so.\n\nNow the next step is to ask the user for the name of a pet.\n\nSo we'll call that variable pet, and we'll assign it the value that the user inputs for\n\nwhat is the name of a pet?\n\nNow step four is to combine the name of the city and the pet and show them their band name.\n\nNow, there's quite a few ways of doing this, especially if you look around on the internet, but the\n\nway that you learned in today's lessons is using string concatenation.\n\nSo we're going to do that.\n\nSo we're going to use a print statement and tell them, \"Your band name could be:...\"\n\nAnd then we're going to add the name of the city, and then add a space and then add the name of their\n\npet.\n\nSo now when we run our code, it will ask us for the name of their city and then the name of a pet.\n\nAnd then it should combine those together and show us the name of our band.\n\nNow the final step is that the input cursor should show on a new line like this.\n\nSo here's the cursor, but here's the input just so that you get a bit of space and you're not typing\n\nit in directly after the prompt here.\n\nLike what we have.\n\nSo how do we do that?\n\nWell, you learned about modifying strings by creating a new line using the \\n, and we can add\n\nthat both to the end of the city input and the pet input,\n\nand now when we run our code, you'll see that the cursor now shows up on the next line,\n\nand our program looks a lot better.\n\nSo there you have it.\n\nThis is how you solve this boss challenge.\n\nAnd this is how you create the Band Name Generator project.\n\nSo I hope you had fun with me today, learning Python and a lot of the fundamentals of Python.\n\nAnd tomorrow I've got another jam-packed module of really awesome tutorials, and code challenges, and\n\nprojects for you to sink your teeth into. I'm looking forward to seeing you tomorrow.\n\nSo have a rest now and let your brain work on the things that you learned while you sleep,\n\nand I'll see you here bright and early.\n\nGood night, and see you tomorrow.",
    "16. Congratulations! Well done!.en_US.vtt": "Well done. You've just completed your first day.\n\nAnd remember that a journey of a thousand miles can't begin without the first\n\nstep. So congratulations on doing that and completing it.\n\nNow,\n\nremember that the first few days might take a little bit longer than an hour to\n\ncomplete,\n\njust because I've got so much to teach you and so much to cram into each of\n\nthese days. So it doesn't matter if you need to take a break in between,\n\nor if you need to take a nap in between even. Just come back to it whenever you\n\ncan, and you don't have to do it strictly in the day by day order. Now,\n\nmy hope is that you'll keep going and you'll come back tomorrow refreshed and\n\nyou'll tackle the next day subjects with the same vigor that you did today.\n\nSo, have a good rest and I'll see you tomorrow.",
    "2. START HERE.en_US.vtt": "Hi, this is where you start the course.\n\nBut first I want to tell you a little bit about it, because this is more than a\n\ncourse. It's a journey. And it's a challenge.\n\nA challenge to yourself. I often hear people say,\n\n\"I want to learn to code\". \"I want to become an app developer\". \"I want a new job\".\n\n\"I want to build my app\", but without action,\n\nthose words are meaningless. But *you* are different!\n\nI know it. Even though I don't know you personally,\n\nI know you purchased this course and you haven't left it at that.\n\nYou've made a start. And success comes to those who show up. And you showed up\n\ntoday. I know you can do this. You can make your dreams come true.\n\nYou can change your own future and you can change the lives of those people\n\naround you.\n\nOne of the questions I hear most often is: \"What's the best way to learn to code?\".\n\nWell, here it\n\nis! It's the 100 days of code challenge. Code for at least an hour. ⏳\n\nOver 100 days. You're practising a muscle to get strong at coding.\n\nThen the next question inevitably is: \"Well,\n\nwhat do I do each day?\" And I've spent years thinking about this question.\n\nAnd finally,\n\nI'm now able to definitively answer that ... it's this course!\n\nEvery day, you're going to learn and apply new programming concepts.\n\nAfter a hundred days of repeating this process,\n\nnot only will you have covered the entire professional Python curriculum,\n\nyou'll also be so good that they can't ignore you.\n\nThere are just two rules to get the most out of this course.\n\n1) Pledge to code for an hour a day for a 100 days. To keep yourself\n\naccountable. I recommend downloading the course pledge.\n\nThis is a contract 🤝 with yourself. You can print it out and pin 📌 it somewhere.\n\nYou can always see, for example, above your computer or on your desk.\n\nBy signing the pledge, you're making a commitment to yourself.\n\nIt's only for you. No one else needs to see it.\n\nYou can download the pledge in the course resources for this lesson.\n\nThe second rule is to log your progress.\n\nUsing the #100DaysOfCode hashtag on Twitter.\n\nThere are millions of other students who are on this journey with you.\n\nAnd they will support you when times get tough.\n\nI recommend tweeting your progress each day with the hashtag #100DaysOfCode\n\nand search the hashtag on Twitter to see what others are doing as a part\n\nof their 100 days. And that's all there is to it!\n\nSo here's to your success and let's get started with the course. 🤞",
    "3. Downloadable Resources and Tips for Taking the Course.en_US.vtt": "Hey guys, it's Angela here. After I made this course,\n\nI decided to take it myself so I could see what it's like to be in your shoes.\n\nAlong the way, I realized there are things we could create,\n\nto make your learning experience easier and even more enjoyable.\n\nSo in this video, I'm going to share my top tips.\n\nAnd how do you use all the tools 🛠 and resources we built for you.\n\nThe first tip I have for you is to use another screen.\n\nThat way you can watch the lesson on a tablet or phone and code on your main\n\ncomputer. So you can code along with me and get practice\n\ninstead of just listening to the videos. Programming is a practical skill.\n\nSo, just as you need practice, when learning skateboarding 🛹,\n\nyou also need practice to get good at Programming. Tip number two:\n\nI created a Python syntax cheat sheet, which you can download and print out.\n\nIt contains some of the most common programming concepts we'll learn.\n\nAnd it's a handy reference to have when you're doing the coding challenges.\n\nYou can download this in the course resources for this lesson where you will\n\nalso find my \"12 Rules to Learn to Code\" eBook.\n\nOne of the hardest things about learning is keeping the ✨motivation✨ high.\n\nI find I'm usually more motivated when I'm in the library or a cafe where I can\n\nsee other people studying or working hard.\n\nSo I decided to create a two-hour \"Study with Me\" a video where I'm concentrating\n\nhard. We'll work for 25 minutes at a time,\n\nand then take a five-minute break before we get back to the next Pomodoro 🍅. Tip\n\nnumber four: when you're learning new programming concepts\n\nit's a good idea to note down how the code works while your mind is fresh on\n\nthat topic.\n\nSo I created a coding notes page that you can print out and collate to create a\n\ncoding notebook.\n\nThe notepaper is the perfect place to write down examples of coding concepts\n\nyou've learnt.\n\nIt comes with line numbers and handy indentation guides,\n\nwhich is super useful when it comes to writing out Python code. Coding is not\n\nlike history. There's nothing you need to memorize.\n\nIt's a bit like baking. You don't need to remember the recipe.\n\nYou just need to get practice and understand how to use the recipe.\n\nOne of the most helpful note-taking systems for learning is the Cornell note\n\nmethod. In our coding notebook\n\nwe've incorporated all the key elements from Cornell,\n\nincluding the sidebar where you can write comments on each line of code and the\n\nbottom summary section,\n\nwhere you can write an overview of the concept you just learnt. In the course\n\nresources for this lesson\n\nyou'll also find some desktop wallpapers I've created for you that contain\n\nsome of the messages I keep around my desk to keep me motivated,\n\nand I hope they'll help you too. Tip number five:\n\ncelebrate right after you complete each day.\n\nBecause this course is designed to take you from beginner to professional,\n\nas you go from day to day,\n\nthere will be less and less tutorial and more and more practice. To keep you on\n\ntrack, I've created a \"100 Days of Code\" poster.\n\nOnce you complete a day, you can check it off on the poster. So print it out,\n\nput it up on a wall and take each day as a challenge.\n\nReward yourself after each day you tick off ✅ and day by day,\n\nyou will learn and grow as a developer.\n\nThis course has a safe space where you can make mistakes, ask questions,\n\nbut most importantly become confident in your skills as a programmer.\n\nI had so much fun building this course,\n\nand I hope that you'll enjoy it as much as I did.\n\nSo here's to your success!",
    "4. Day 1 Goals what we will make by the end of the day.en_US.vtt": "Hey guys, welcome to Day 1 of your 100-Day journey.\n\nAnd today we're going to learn about Printing, Commenting, Debugging, String manipulation and Variables.\n\nSo it's chock-a-block full of really fun stuff.\n\nAnd by the end of today, you will have created a Band Name Generator program.\n\nSo this is the final project of today.\n\nAnd the idea is that let's say that your friend was starting a new band, a rock band or a classical\n\nband, and they're struggling to come up with a good name.\n\nSo you come into the rescue and send them your Band Name Generator program.\n\nSo it asks you for the name of the city that you grew up in,\n\nso mine was Bristol in the southwest of the UK.\n\nAnd then it'll ask you, what's the name of your pet?\n\nI had a pet rabbit when I was younger, and I am probably, the least imaginative person,\n\nclassic programmer personality,\n\nso I called my rabbit, \"Rabbit\".\n\nSo now when I hit Enter, it's going to give me my band name, and it could be, Bristol Rabbit.\n\nSo that sounds pretty cool.\n\nIt could be like a rock band.\n\nSo this is what you're going to make,\n\nand in the process, in order to create this, you're going to learn about Printing, Inputting, Commenting,\n\nDebugging, Name Errors, Syntax Errors, String Manipulation Variables, and a whole lot more.\n\nSo if you feel like you can already achieve this, and you can prove it by making this program yourself,\n\nthen feel free to skip to the next day's lessons.\n\nBut for most of you, even if you've started learning Python programming, there's probably still a\n\nlot of new things that you'll find in today's lessons.\n\nNow, as with all the projects that we're making in this course, you get to try it out before you make\n\nit.\n\nSo you can either go to the URL,\n\nalternatively, if you don't want to type out the full URL, you can head over to the Course content\n\nhere, and then click on the Resources and click this link to head straight over there.\n\nAnd then once you're there, all you have to do is to click Run and you'll be able to preview how the\n\nfinal product is going to work.\n\nSo you can type in your own city and follow the instructions until you get to the end result.\n\nSo once you're ready, head over to the next lesson and let's get started and get coding straight away.",
    "6. Printing to the Console in Python.en_US.vtt": "Now,\n\nhopefully, you've already got everything set up so that you're ready to go on the Day 1 tasks, and you're\n\nable to see what I'm seeing right here.\n\nNow, if you don't know what I'm talking about, or if you don't have access to any of this, be sure\n\nto go back to the previous lesson where I showed you, step-by-step, 'How to Download' and get hold of\n\nthe latest version of the Curriculum Exercises on PyCharm. So be sure you do that before you proceed,\n\nso that we're all starting at the same place and you're seeing exactly what is shown in the videos,\n\nand we're ready to start learning how to program.\n\nNow, remember that the whole reason why we're learning to program is to be able to tell the computer\n\nwhat it needs to do, and for it to follow our commands.\n\nSo let's go ahead and tell the computer to do something.\n\nAnd we're going to do that by writing our first line of code.\n\nSo in this case I'm creating something called a \"print function\", which is just the word print all in\n\nlowercase and then followed by a set of parentheses().\n\nNow inside these parentheses, I'm going to tell it what I want it to print.\n\nAnd hopefully it's going to output that inside our console.\n\nSo I'm going to start off by writing the classic \"Hello world!\" inside here,\n\nand then once you're ready then go ahead and click Run.\n\nAfter a few seconds you should see the computer follow your command, namely printing the words that\n\nyou told it to print inside the console or the output area over here.\n\nAnd once it's done, it indicates that by writing, \"Process finished with exit code 0\", which means\n\neverything was successful, everything was run without any issues.\n\nNow, just to break down this area a little bit more for you, if you look at the top line here, which\n\nyou'll always, always see, there's a lot of text in here, but it's actually very simple to understand.\n\nEssentially, it's telling you the location of the current file that is being run that has resulted in\n\nthis output.\n\nSo in our case, it's the Day 1 task.\n\nAnd you'll see this change as you go through the different days\n\nbecause the location of this file, where you wrote the code, will change.\n\nSo the first line is the location of the file that you executed.\n\nThe second line, or multiple lines in between, is the result of your command to the computer.\n\nAnd then finally at the very, very end, it tells you if the process finished with success, which\n\nis in this case, or if there are any other issues, it would show up here as well, which we're going\n\nto see very, very shortly.\n\nAnd to be sure that you're always running the current file, make sure that this drop down is selected\n\nas Current File,\n\nand that way, every time you press the play button here, it will run the code into the output area.\n\nNow if you want to do a shortcut and you're really into keyboard shortcuts, you can hover over the\n\nplay button and you'll see the shortcut on what I'm using, which is a Mac, is  Control + R, in Windows\n\nor Linux,\n\nit'll show up different shortcuts, but it should all show up there if you want to try that out.\n\nAlternatively, just keep pressing the play button and it works just as well.\n\nAnd the way that this command works is super simple.\n\nYou have the keyword, \"print\", followed by a set of parentheses, and then inside the parentheses, you\n\ntell it what you want it to print.\n\nAnd once you've inserted that, then when this line of code gets executed by the computer, it'll know\n\nto simply print or output the thing that you've placed in between the parentheses.\n\nBut notice here that it's not just the word, \"Hello world!\", that I've put inside my parentheses,\n\nI've also added some quotation marks or double quotes around the word,\n\nand the reason why I've done this is so that I can tell the computer that this bit here, in between\n\nthe double quotes, is not code.\n\nIt's not like print where it's supposed to do something,\n\nthis is just some text that I've made up, that I want it to print out.\n\nAnd these pieces of text in programming lingo, is known as \"Strings\".\n\nAnd you can imagine it as almost like a pearl necklace.\n\nRight?\n\nIt's a string of characters.\n\nAnd what the double quotes do, is they basically show the beginning and the end of that string of characters.\n\nSo that means you have to be really careful when you're typing.\n\nFor example, if I go ahead and I miss out the closing double quote, well, now you can see that there's\n\nsome changes that have happened to our code already, namely that the last parentheses, instead of\n\nbeing colored in white like the opening parentheses or how it used to be, it's now colored in green,\n\nthe same color as the rest of our text or our string.\n\nAnd this is a subtle hint to us.\n\nYou're going to get really attuned to these subtle hints, because they are the clues that will tell\n\nyou what might have gone wrong in your code.\n\nIf I run this code as it is right now, it's going to break.\n\nIt's going to give me a SyntaxError, and it says something that seems like it's completely not English.\n\nSo how can we figure out what this means?\n\nNow, the thing I want you to know is that all programmers make mistakes.\n\nWe all make lots of errors, like forgetting to add the double quotes at the end of the string, or\n\nforgetting to add a closing parentheses.\n\nThese things are just common errors because we're human.\n\nBut the thing that differentiates great programmers is we're really good at figuring out what the problem\n\nis and how to fix it.\n\nSo you can imagine that coding is just a whole bunch of problems that you have to solve.\n\nAnd in this case, when we get some sort of red text, and our code is not doing what we expect it to do,\n\nthen all we have to do is take this entire error message where it says something, something error,\n\nand this is some sort of message that we're supposed to understand, and we're simply going to drop\n\nit into Google.\n\nAnd usually the first link you come across will be from a website called stackoverflow.com.\n\nAnd this is basically the Q&amp;A website that all developers will go to whenever something is wrong with\n\ntheir code, or when they can't figure out how to do something.\n\nSo if we click on this link, you can see that somebody else has also had this error,\n\nand some kind souls have told us that the solution might be the fact that you're missing a double quote\n\nbefore the end of the line.\n\nSo if we take a look back at our code, the code that generated this error looks like this.\n\nAnd indeed, we are missing a double quote at the end of our string.\n\nAs you're learning to code, as you're going through your 100 Days, I want you to become more and more\n\nattuned to the color of your code, because one of the most helpful things that code editors such as\n\nthis do for us is something called, \"Syntax highlighting\".\n\nFor example, when I was missing that double quote, it highlighted this entire thing and that is basically\n\nit telling us, it seems like this whole thing is some text.\n\nIt thinks that all of this is a string and that we're missing a closing parenthesis.\n\nSo if you notice this and you're like, wait, actually that's not right,\n\nthis part should match the color of the open brace, which is white.\n\nSo there must be something wrong here.\n\nAnd indeed, if you have a look at the error message, it actually has a little caret sign right here\n\nshowing you that there's something that's probably not right here.\n\nAnd it might jog your memory that, \"Oh yeah, I've forgotten a closing double quote.\"\n\nNow, the really handy thing about PyCharm is it actually underlines your errors before you even run\n\nyour code.\n\nAnd if you hover over the underline, it usually gives you some intelligent guess as to what your problem\n\nmight be.\n\nAnd in this case, it's absolutely spot on.\n\nIt says, you're missing a closing quote, which is exactly what we're missing.\n\nSo that will also be really helpful for us to figure out what it is that we need to do.\n\nBut as with all things with AI, if we don't know what we're doing in the first place, these hints\n\ndon't help us that much.\n\nFor example, if I put the closing quote right here, I've got other problems and I'm going to create\n\nmore problems for myself.\n\nSo it's important that we first understand how things work and then use technology and AI to help us,\n\nsuch as in this case, to fix our bug.\n\nNow, you'll notice that there is also a tiny squiggly line under this closing brace, but in this case,\n\nit's not in red, so it's not an error, but instead it's in yellow, which is a warning.\n\nNow, most of these warnings come from a good standard practice for how to write code.\n\nAnd if we hover over this warning, it tells us that PEP 8, which is guidance for how to write\n\nPython code, and it tells you that the problem that it's seeing is there's no new line at the end of\n\nthe file.\n\nNow, we can ignore all of this because it's a bit too complicated, and it's actually very simple to\n\nsolve this problem.\n\nAll it's saying is that in good practice, when we're writing Python code, there should be a new line\n\nat the end of the file so that we have our cursor down here instead of ending right there.\n\nAnd that's all there is to it.\n\nAnd with that one thing, we've gotten rid of all our errors,\n\nwe've gotten rid of all our warnings,\n\nour code looks good stylistically, as well as syntactically.\n\nAll these big words that all that it means is that it looks great in every single way.\n\nAnd we've got our little check mark, which means no problems found by the editor.\n\nNow, sometimes the editor can be really picky, and some of the things that it tells you, you can safely\n\nignore,\n\nbut as always, we need to understand how everything works before we can do that.\n\nSo now that we've embarked on our first step to write some code and start commanding the computer to\n\ndo what we want it to do, which is to print out some words into the output area,\n\nit's now time for a challenge.\n\nSo head over to the next lesson, and we're going to test you on what you've learned in this lesson\n\nby practicing writing some print statements.\n\nSo for all of that and more, I'll see you on the next lesson.",
    "8. String Manipulation and Code Intelligence.en_US.vtt": "All right, guys, let's get back to learning about a few more things that we can do with strings.\n\nYou saw in the last lesson that if we wanted to print things on individual lines, then we actually\n\nhad to write them a few times, right?\n\nWe had to write print on three lines if we wanted it to be printed one, two, three,\n\nlike so.\n\nNow in this lesson, I want to show you a method where we can do the same thing, but by using a single\n\nprint() method, so saving ourselves a few characters.\n\nSo the way that we would create a new line is by writing a backslash and the n character (\\n).\n\nAnd now if I go ahead and write \"Hello world!\" again afterwards, and I hit Run, and you can see that\n\nonce that line of code has been executed, I've got \"Hello world!\" printed on two separate lines, separated\n\nby this \\n character, which gets replaced by a new line.\n\nSo go ahead and give that a go and see if you can create another one.\n\nRemember though, it's a backslash (\\) and not a forward slash (/).\n\nBut the syntax highlighting should help you.\n\nAll right.\n\nWe can simply just add another \\n and remember that unless you want a space to appear right\n\nbefore where your \"Hello world!\" appears, you actually don't want any gaps between each of these lines.\n\nThere we go.\n\nWe've got the same result as before, but now using only a single print statement and creating some\n\nnew lines with the \\n.\n\nNow, one of the other things that we can do with strings is we can concatenate them.\n\nWhat this means is we combine different strings so that they will be added to the end of another string.\n\nHere's an example,\n\nlet's say that we had the word Hello, and I wanted to add my name to the end of this word to make it\n\na single string.\n\nWell, I can combine two strings by simply using a plus sign so I can write \"Hello\" + \"Angela\".\n\nNow here's a question,\n\nwhen this runs, what do you think it will look like?\n\nDo you think it'll write, Hello Angela or HelloAngela,\n\nall in one word?\n\nLet's see what happens.\n\nYou can see that these two strings have now been combined into one, and there's no space in between\n\nbecause we don't have a space character anywhere in here.\n\nPause the video and see if you can add a space in between.\n\nAll right.\n\nSo there's two ways that you can do this.\n\nWell maybe three actually, you could add a space to the end of Hello,\n\nyou could add a space to the beginning of Angela, or you can actually continue using string concatenation\n\nby simply adding another string in between these two,\n\nand this one is just a space.\n\nSo now when I run my code you can see the space gets inserted, and this long thing gets combined into\n\na single string that looks like this\n\nonce this bit of the code gets executed. If we think of strings as a string of connected characters,\n\nthen string concatenation is simply taking those separate strings of characters and merging them into\n\none.\n\nNow, this is a good point to mention that in Python programming spaces are really, really important.\n\nAnd what I mean by this is not so much the spaces that are inside strings like this one, but the spaces\n\nthat you add in your code.\n\nSo here you can see that the print statement starts at the very beginning of this Line 2,\n\nbut what happens if I add a space before the print statement?\n\nNow you can see I've got the editor screaming at me already.\n\nI've got errors, I've got squiggly lines, and if I run this code as it is, I'll get something that's\n\ncalled an IndentationError.\n\nNow this is different to the previous error we had which was a SyntaxError.\n\nNow what this error tells you is that there is an unexpected indent around this part of your code.\n\nThat's what the error message is telling me.\n\nSo we can then go and investigate and see our squiggly lines and we can hopefully realize that, \"Oops,\n\nwe've added an extra space which we can easily get rid of,\" and it will calm everything down and get\n\nrid of that error.\n\nSo remember, previously we were missing a closing quotation mark and we got a SyntaxError,\n\nand in this case, we have an indentationError by either adding in an aberrant space or accidentally inserting\n\neven a whole tab which is created using the tab key.\n\nAnd all of these things will give you indentation errors.\n\nSo it's really important that you be careful when you're adding spaces in your Python code.\n\nIt doesn't matter so much when we have spaces in between the quotation marks, because that's a part\n\nof the string, but anywhere that is a part of the code.\n\nSo in this case, anything that's not green and you go ahead and add some spaces, you might end up\n\nwith an IndentationError.\n\nNow you might also, when you add spaces in your code, not have an IndentationError because the code\n\ncan function,\n\nfor example, if I add a space between print and the parentheses,\n\nbut in this case nothing really changes in terms of our output,\n\nbut we do get a warning because this is not really ideally how we should format our code.\n\nSo our warning tells us that according to PEP 8 and best practices, there shouldn't be whitespace before\n\nan open parenthesis.\n\nSo we can also use that hint to get rid of any of these issues.\n\nSo the message here is be careful when you're adding spaces.\n\nMake sure you know what it's doing,\n\nand when you see the error, IndentationError,\n\nremember what you learned in this lesson to be able to fix it. Now, as helpful as these warnings and\n\nerrors are, you'll notice that I'm putting a lot of emphasis on looking at the errors that come out\n\nafter we hit Run,\n\nand that's because this comes from the Python compiler itself.\n\nThis will be the same whenever you write Python code.\n\nHowever, these squiggly lines and these errors that you get when you hover over them are specific to\n\nthe editor that we're using here, which is PyCharm.\n\nNow, if you happen to be using a different type of editor, they might not give you the same kind of\n\nwarnings, and they might not give you the same kind of errors.\n\nAnd the messages will also be wildly different.\n\nSo it's always really important to learn the errors that you get back after you run your code,\n\nand to remember these words SyntaxError or IndentationError,\n\nand this is something that will help you no matter what tools you use, making you a more flexible developer.\n\nAnd we're going to see this in practice right now because I've got a debugging exercise coming up for\n\nyou right after this lesson, and we're going to be doing it inside a different editor without the assistance\n\nof all of these helpful squiggly lines.\n\nSo can you rely on your skills, your ability to debug when you run your code and see error messages,\n\nand go through each of the lines of the debugging exercise one by one, and fix each problem from top\n\nto bottom.\n\nThis word debugging actually comes from a story where back in the 80s, a moth actually flew into one\n\nof the early computers and it got electrocuted,\n\nunfortunately for the moth, and for the programmer, it meant that his code wasn't performing as he would\n\nexpect it to, so he actually had to go into the computer, pick out the moth and fix the wires so that\n\nit would work again.\n\nNow, we don't have any moths flying around in our code, thankfully, but what we do have to do is\n\nwe have to pick out the errors so that our code will run in the way that we expect it to without any\n\nerrors.\n\nSo head over to the next lesson and try out your first debugging exercise."
  },
  "htmls": {
    "12.3 Variables.html": {
      "title": "Variables",
      "hasInstructions": false,
      "hasTests": true,
      "hasSolutions": true,
      "instructions": "<p>We have 2 variables glass1 and glass2. glass1 contains milk and glass2 contains juice. Write 3 lines of code to switch the contents of the variables. <strong>You are not allowed to type the words \"milk\" or \"juice\"</strong>. You are only allowed to use variables to solve this exercise. </p><p><br></p><p><img src=\"https://img-c.udemycdn.com/redactor/raw/coding_exercise_instructions/2024-07-09_14-03-15-a9e6cd71b9833f2754a4efd5549b08da.jpeg\"></p><p><br></p><p><br></p>",
      "tests": [
        {
          "file_name": "evaluate.py",
          "content": "import sys\nfrom unittest import TestCase\nimport exercise  # Imports student's solution\n\nclass Evaluate(TestCase):\n\n    def test_glass1(self):\n        self.assertEqual(exercise.glass1, \"juice\", \"glass1 should be 'juice' after switching\")\n\n    def test_glass2(self):\n        self.assertEqual(exercise.glass2, \"milk\", \"glass2 should be 'milk' after switching\")\n\n"
        }
      ],
      "solutions": [
        {
          "file_name": "exercise.py",
          "content": "glass1 = \"milk\"\nglass2 = \"juice\"\n\ntemp = glass1\nglass1 = glass2\nglass2 = temp\n\n"
        }
      ]
    },
    "14.1 Variable Naming Quiz.html": {
      "quiz_id": 4789696,
      "quiz_title": "Variable Naming Quiz",
      "questions": [
        {
          "_class": "assessment",
          "id": 14918162,
          "assessment_type": "multiple-choice",
          "prompt": {
            "relatedLectureIds": [
              "17837488"
            ],
            "feedbacks": [
              "In Python you don't need a keyword to create a variable. You can simply write a = 12",
              "You got it!",
              "In Python you use the equals sign to create a variable, e.g. a = 12",
              "The name of the variable goes first then the value that's associated with the variable comes after a equals sign. e.g. a = 12"
            ],
            "answers": [
              "<p><code>var a = 12</code> </p>",
              "<p><code>a = 12</code> </p>",
              "<p><code>a: 12</code> </p>",
              "<p><code>12 = a</code> </p>"
            ],
            "question": "<p>Which line of Python code is valid?</p>"
          },
          "correct_response": [
            "b"
          ],
          "section": "",
          "question_plain": "Which line of Python code is valid?",
          "related_lectures": [
            {
              "_class": "lecture",
              "id": 17837488,
              "title": "Python Variables",
              "created": "2020-01-28T12:02:59Z",
              "is_published": true,
              "asset": {
                "_class": "asset",
                "id": 59808847,
                "asset_type": "Video",
                "title": "1.7 2024 10 09 Variables.mp4",
                "created": "2024-10-10T09:29:45Z"
              },
              "object_index": 9,
              "url": "/course/100-days-of-code/learn/lecture/17837488"
            }
          ]
        },
        {
          "_class": "assessment",
          "id": 14918176,
          "assessment_type": "multiple-choice",
          "prompt": {
            "question": "<p>Which is the <strong>best</strong> variable name for Player 1's username?</p>",
            "relatedLectureIds": [
              "17837500"
            ],
            "feedbacks": [
              "You can't have spaces in between when you create a variable. ",
              "You can't have numbers as the first thing in your variable name.",
              "",
              "Although this is valid code, it's not the best choice because it's really hard to tell what the variable name actually refers to. Imagine another team member trying to read your code, do you think they will immediately know that p1u is the player 1 username?"
            ],
            "answers": [
              "<p><code>p1 user name = \"jackbauer\"</code> </p>",
              "<p><code>1_player_username = \"jackbauer\"</code> </p>",
              "<p><code>player1_username = \"jackbauer\"</code> </p>",
              "<p><code>p1u = \"jackbauer\"</code> </p>"
            ]
          },
          "correct_response": [
            "c"
          ],
          "section": "",
          "question_plain": "Which is the best variable name for Player 1's username?",
          "related_lectures": [
            {
              "_class": "lecture",
              "id": 17837500,
              "title": "Variable Naming",
              "created": "2020-01-28T12:03:30Z",
              "is_published": true,
              "asset": {
                "_class": "asset",
                "id": 58280167,
                "asset_type": "Video",
                "title": "1.9 Variable Naming.mp4",
                "created": "2024-08-02T11:32:47Z"
              },
              "object_index": 10,
              "url": "/course/100-days-of-code/learn/lecture/17837500"
            }
          ]
        },
        {
          "_class": "assessment",
          "id": 14918220,
          "assessment_type": "multiple-choice",
          "prompt": {
            "question": "<p>Which block of code will produce an error? For extra points, which type of error do you think it will produce?</p>",
            "relatedLectureIds": [
              "17837500"
            ],
            "feedbacks": [
              "There is a typo in the last line, it should be time_until_midnight not time_until_Midnight. Because when the name of the variable was used it was not spelt the same, you will get a name error.",
              "This block of code will *not* produce an error. ",
              "The spaces around the + sign is optional, the computer doesn't care, it's for humans to be able to read it more easily. This will not produce an error."
            ],
            "answers": [
              "<pre class=\"prettyprint linenums\">time_until_midnight = \"5\"\nprint(\"There are \" + time_until_Midnight + \" hours until midnight\")</pre>",
              "<pre class=\"prettyprint linenums\">num_hours = \"5\"\nprint(\"There are \" + num_hours + \" hours until midnight\")</pre>",
              "<pre class=\"prettyprint linenums\">time_until_midnight = \"5\"\nprint(\"There are \"+time_until_midnight+\" hours until midnight\")</pre>"
            ]
          },
          "correct_response": [
            "a"
          ],
          "section": "",
          "question_plain": "Which block of code will produce an error? For extra points, which type of error do you think it will produce?",
          "related_lectures": [
            {
              "_class": "lecture",
              "id": 17837500,
              "title": "Variable Naming",
              "created": "2020-01-28T12:03:30Z",
              "is_published": true,
              "asset": {
                "_class": "asset",
                "id": 58280167,
                "asset_type": "Video",
                "title": "1.9 Variable Naming.mp4",
                "created": "2024-08-02T11:32:47Z"
              },
              "object_index": 10,
              "url": "/course/100-days-of-code/learn/lecture/17837500"
            }
          ]
        }
      ]
    },
    "5. Download and Setup PyCharm for Learning.html": null,
    "7.1 Printing Practice.html": {
      "title": "Printing Practice",
      "hasInstructions": false,
      "hasTests": true,
      "hasSolutions": true,
      "instructions": "<p>Write a program that uses print statements to print the following recipe into the Output console. The text to print is already there, you just need to make it into code. Your code should print all five lines exactly the same as the example output below. Make sure that you don't change any of these existing text as everything, punctuation and casing all need to match!</p><p><br></p><p><strong>Example Output</strong></p><p><br></p><p><img src=\"https://img-c.udemycdn.com/redactor/raw/coding_exercise_instructions/2024-07-09_10-19-35-c16281122d1736cf9f9e9898f6dd7984.png\"></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>",
      "tests": [
        {
          "file_name": "evaluate.py",
          "content": "import sys\nfrom unittest import TestCase\nimport importlib\n\nclass Evaluate(TestCase):\n\n    def test_output(self):\n        import main\n        output = sys.stdout.getvalue()\n        expected_output = \"1. Mix 500g of Flour, 10g Yeast and 300ml Water in a bowl.\\n2. Knead the dough for 10 minutes.\\n3. Add 3g of Salt.\\n4. Leave to rise for 2 hours.\\n5. Bake at 200 degrees C for 30 minutes.\\n\"\n        self.assertEqual(expected_output, output, \"Output does not match expected output, check you havn't changed the original punctuation or letter casing at all.\")\n\n",
          "type": ""
        }
      ],
      "solutions": [
        {
          "file_name": "main.py",
          "content": "print(\"1. Mix 500g of Flour, 10g Yeast and 300ml Water in a bowl.\")\nprint(\"2. Knead the dough for 10 minutes.\")\nprint(\"3. Add 3g of Salt.\")\nprint(\"4. Leave to rise for 2 hours.\")\nprint(\"5. Bake at 200 degrees C for 30 minutes.\")\n\n",
          "type": ""
        }
      ]
    },
    "9.2 Debugging Practice.html": {
      "title": "Debugging Practice",
      "hasInstructions": false,
      "hasTests": true,
      "hasSolutions": true,
      "instructions": "<p>Look at the code in the code editor. There are errors on all 5 lines of code. Fix the code so that it runs without errors.</p><p>Try to run the code and debug each line using the error messages and feedback.</p><p><strong>Example Output</strong></p><img src=\"https://img-c.udemycdn.com/redactor/raw/coding_exercise_instructions/2024-07-11_09-08-26-0701193b6152f1931396be5d5b5605a6.png\"><p><br></p><p><br></p><p><br></p>",
      "tests": [
        {
          "file_name": "evaluate.py",
          "content": "import sys\nfrom unittest import TestCase\n \nclass Evaluate(TestCase):\n    def test_debugging(self):\n        import main  # Imports and runs student's solution\n        output = sys.stdout.getvalue()  # Returns output since this function started\n        self.assertEqual(\"Notes from Day 1\\nThe print statement is used to output strings\\nStrings are strings of characters\\nString Concatenation is done with the + sign\\nNew lines can be created with a \\ and the letter n\\n\", output, \"Make sure you are printing out all 5 lines.\")"
        }
      ],
      "solutions": [
        {
          "file_name": "main.py",
          "content": "print(\"Notes from Day 1\")\nprint(\"The print statement is used to output strings\")\nprint(\"Strings are strings of characters\")\nprint(\"String Concatenation is done with the + sign\")\nprint(\"New lines can be created with a \\ and the letter n\")"
        }
      ]
    }
  },
  "txts": {
    "15. Course-Fixes-Report-an-Issue.txt": "https://docs.google.com/forms/d/e/1FAIpQLSdwbmx2whgRNiciYXiSs2lJT6-dOYgvqGnXdVqfLv1fjln7kw/viewform?usp=send_form",
    "15. Final-project-demo-click-Run-to-try-it.txt": "https://appbrewery.github.io/python-day1-demo/",
    "3. FAQ-I-Cant-Open-the-Course-Resource-Links.txt": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23544648#questions/13314700",
    "3. Join-the-Student-Community-on-Discord.txt": "https://discord.gg/3DDPkCAU3N",
    "3. Study-With-Me-Video.txt": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23518346#search",
    "4. Press-Run-to-see-the-final-project.txt": "https://appbrewery.github.io/python-day1-demo/"
  }
}